MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
extern volatile MD1CARLbits_t MD1CARLbits __at(0x318);
// bitfield macros
#define _MD1CARL_CL_POSN                                    0x0
#define _MD1CARL_CL_POSITION                                0x0
#define _MD1CARL_CL_SIZE                                    0x5
#define _MD1CARL_CL_LENGTH                                  0x5
#define _MD1CARL_CL_MASK                                    0x1F
#define _MD1CARL_CL0_POSN                                   0x0
#define _MD1CARL_CL0_POSITION                               0x0
#define _MD1CARL_CL0_SIZE                                   0x1
#define _MD1CARL_CL0_LENGTH                                 0x1
#define _MD1CARL_CL0_MASK                                   0x1
#define _MD1CARL_CL1_POSN                                   0x1
#define _MD1CARL_CL1_POSITION                               0x1
#define _MD1CARL_CL1_SIZE                                   0x1
#define _MD1CARL_CL1_LENGTH                                 0x1
#define _MD1CARL_CL1_MASK                                   0x2
#define _MD1CARL_CL2_POSN                                   0x2
#define _MD1CARL_CL2_POSITION                               0x2
#define _MD1CARL_CL2_SIZE                                   0x1
#define _MD1CARL_CL2_LENGTH                                 0x1
#define _MD1CARL_CL2_MASK                                   0x4
#define _MD1CARL_CL3_POSN                                   0x3
#define _MD1CARL_CL3_POSITION                               0x3
#define _MD1CARL_CL3_SIZE                                   0x1
#define _MD1CARL_CL3_LENGTH                                 0x1
#define _MD1CARL_CL3_MASK                                   0x8
#define _MD1CARL_CL4_POSN                                   0x4
#define _MD1CARL_CL4_POSITION                               0x4
#define _MD1CARL_CL4_SIZE                                   0x1
#define _MD1CARL_CL4_LENGTH                                 0x1
#define _MD1CARL_CL4_MASK                                   0x10
#define _MD1CARL_MD1CL_POSN                                 0x0
#define _MD1CARL_MD1CL_POSITION                             0x0
#define _MD1CARL_MD1CL_SIZE                                 0x5
#define _MD1CARL_MD1CL_LENGTH                               0x5
#define _MD1CARL_MD1CL_MASK                                 0x1F
#define _MD1CARL_MD1CL0_POSN                                0x0
#define _MD1CARL_MD1CL0_POSITION                            0x0
#define _MD1CARL_MD1CL0_SIZE                                0x1
#define _MD1CARL_MD1CL0_LENGTH                              0x1
#define _MD1CARL_MD1CL0_MASK                                0x1
#define _MD1CARL_MD1CL1_POSN                                0x1
#define _MD1CARL_MD1CL1_POSITION                            0x1
#define _MD1CARL_MD1CL1_SIZE                                0x1
#define _MD1CARL_MD1CL1_LENGTH                              0x1
#define _MD1CARL_MD1CL1_MASK                                0x2
#define _MD1CARL_MD1CL2_POSN                                0x2
#define _MD1CARL_MD1CL2_POSITION                            0x2
#define _MD1CARL_MD1CL2_SIZE                                0x1
#define _MD1CARL_MD1CL2_LENGTH                              0x1
#define _MD1CARL_MD1CL2_MASK                                0x4
#define _MD1CARL_MD1CL3_POSN                                0x3
#define _MD1CARL_MD1CL3_POSITION                            0x3
#define _MD1CARL_MD1CL3_SIZE                                0x1
#define _MD1CARL_MD1CL3_LENGTH                              0x1
#define _MD1CARL_MD1CL3_MASK                                0x8
#define _MD1CARL_MD1CL4_POSN                                0x4
#define _MD1CARL_MD1CL4_POSITION                            0x4
#define _MD1CARL_MD1CL4_SIZE                                0x1
#define _MD1CARL_MD1CL4_LENGTH                              0x1
#define _MD1CARL_MD1CL4_MASK                                0x10

// Register: MD1CARH
#define MD1CARH MD1CARH
extern volatile unsigned char           MD1CARH             __at(0x319);
#ifndef _LIB_BUILD
asm("MD1CARH equ 0319h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :5;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
        unsigned CH4                    :1;
    };
    struct {
        unsigned MD1CH                  :5;
    };
    struct {
        unsigned MD1CH0                 :1;
        unsigned MD1CH1                 :1;
        unsigned MD1CH2                 :1;
        unsigned MD1CH3                 :1;
        unsigned MD1CH4                 :1;
    };
} MD1CARHbits_t;
extern volatile MD1CARHbits_t MD1CARHbits __at(0x319);
// bitfield macros
#define _MD1CARH_CH_POSN                                    0x0
#define _MD1CARH_CH_POSITION                                0x0
#define _MD1CARH_CH_SIZE                                    0x5
#define _MD1CARH_CH_LENGTH                                  0x5
#define _MD1CARH_CH_MASK                                    0x1F
#define _MD1CARH_CH0_POSN                                   0x0
#define _MD1CARH_CH0_POSITION                               0x0
#define _MD1CARH_CH0_SIZE                                   0x1
#define _MD1CARH_CH0_LENGTH                                 0x1
#define _MD1CARH_CH0_MASK                                   0x1
#define _MD1CARH_CH1_POSN                                   0x1
#define _MD1CARH_CH1_POSITION                               0x1
#define _MD1CARH_CH1_SIZE                                   0x1
#define _MD1CARH_CH1_LENGTH                                 0x1
#define _MD1CARH_CH1_MASK                                   0x2
#define _MD1CARH_CH2_POSN                                   0x2
#define _MD1CARH_CH2_POSITION                               0x2
#define _MD1CARH_CH2_SIZE                                   0x1
#define _MD1CARH_CH2_LENGTH                                 0x1
#define _MD1CARH_CH2_MASK                                   0x4
#define _MD1CARH_CH3_POSN                                   0x3
#define _MD1CARH_CH3_POSITION                               0x3
#define _MD1CARH_CH3_SIZE                                   0x1
#define _MD1CARH_CH3_LENGTH                                 0x1
#define _MD1CARH_CH3_MASK                                   0x8
#define _MD1CARH_CH4_POSN                                   0x4
#define _MD1CARH_CH4_POSITION                               0x4
#define _MD1CARH_CH4_SIZE                                   0x1
#define _MD1CARH_CH4_LENGTH                                 0x1
#define _MD1CARH_CH4_MASK                                   0x10
#define _MD1CARH_MD1CH_POSN                                 0x0
#define _MD1CARH_MD1CH_POSITION                             0x0
#define _MD1CARH_MD1CH_SIZE                                 0x5
#define _MD1CARH_MD1CH_LENGTH                               0x5
#define _MD1CARH_MD1CH_MASK                                 0x1F
#define _MD1CARH_MD1CH0_POSN                                0x0
#define _MD1CARH_MD1CH0_POSITION                            0x0
#define _MD1CARH_MD1CH0_SIZE                                0x1
#define _MD1CARH_MD1CH0_LENGTH                              0x1
#define _MD1CARH_MD1CH0_MASK                                0x1
#define _MD1CARH_MD1CH1_POSN                                0x1
#define _MD1CARH_MD1CH1_POSITION                            0x1
#define _MD1CARH_MD1CH1_SIZE                                0x1
#define _MD1CARH_MD1CH1_LENGTH                              0x1
#define _MD1CARH_MD1CH1_MASK                                0x2
#define _MD1CARH_MD1CH2_POSN                                0x2
#define _MD1CARH_MD1CH2_POSITION                            0x2
#define _MD1CARH_MD1CH2_SIZE                                0x1
#define _MD1CARH_MD1CH2_LENGTH                              0x1
#define _MD1CARH_MD1CH2_MASK                                0x4
#define _MD1CARH_MD1CH3_POSN                                0x3
#define _MD1CARH_MD1CH3_POSITION                            0x3
#define _MD1CARH_MD1CH3_SIZE                                0x1
#define _MD1CARH_MD1CH3_LENGTH                              0x1
#define _MD1CARH_MD1CH3_MASK                                0x8
#define _MD1CARH_MD1CH4_POSN                                0x4
#define _MD1CARH_MD1CH4_POSITION                            0x4
#define _MD1CARH_MD1CH4_SIZE                                0x1
#define _MD1CARH_MD1CH4_LENGTH                              0x1
#define _MD1CARH_MD1CH4_MASK                                0x10

// Register: MD2CON0
#define MD2CON0 MD2CON0
extern volatile unsigned char           MD2CON0             __at(0x31B);
#ifndef _LIB_BUILD
asm("MD2CON0 equ 031Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD2BIT                 :1;
        unsigned                        :3;
        unsigned MD2OPOL                :1;
        unsigned MD2OUT                 :1;
        unsigned                        :1;
        unsigned MD2EN                  :1;
    };
} MD2CON0bits_t;
extern volatile MD2CON0bits_t MD2CON0bits __at(0x31B);
// bitfield macros
#define _MD2CON0_BIT_POSN                                   0x0
#define _MD2CON0_BIT_POSITION                               0x0
#define _MD2CON0_BIT_SIZE                                   0x1
#define _MD2CON0_BIT_LENGTH                                 0x1
#define _MD2CON0_BIT_MASK                                   0x1
#define _MD2CON0_OPOL_POSN                                  0x4
#define _MD2CON0_OPOL_POSITION                              0x4
#define _MD2CON0_OPOL_SIZE                                  0x1
#define _MD2CON0_OPOL_LENGTH                                0x1
#define _MD2CON0_OPOL_MASK                                  0x10
#define _MD2CON0_OUT_POSN                                   0x5
#define _MD2CON0_OUT_POSITION                               0x5
#define _MD2CON0_OUT_SIZE                                   0x1
#define _MD2CON0_OUT_LENGTH                                 0x1
#define _MD2CON0_OUT_MASK                                   0x20
#define _MD2CON0_EN_POSN                                    0x7
#define _MD2CON0_EN_POSITION                                0x7
#define _MD2CON0_EN_SIZE                                    0x1
#define _MD2CON0_EN_LENGTH                                  0x1
#define _MD2CON0_EN_MASK                                    0x80
#define _MD2CON0_MD2BIT_POSN                                0x0
#define _MD2CON0_MD2BIT_POSITION                            0x0
#define _MD2CON0_MD2BIT_SIZE                                0x1
#define _MD2CON0_MD2BIT_LENGTH                              0x1
#define _MD2CON0_MD2BIT_MASK                                0x1
#define _MD2CON0_MD2OPOL_POSN                               0x4
#define _MD2CON0_MD2OPOL_POSITION                           0x4
#define _MD2CON0_MD2OPOL_SIZE                               0x1
#define _MD2CON0_MD2OPOL_LENGTH                             0x1
#define _MD2CON0_MD2OPOL_MASK                               0x10
#define _MD2CON0_MD2OUT_POSN                                0x5
#define _MD2CON0_MD2OUT_POSITION                            0x5
#define _MD2CON0_MD2OUT_SIZE                                0x1
#define _MD2CON0_MD2OUT_LENGTH                              0x1
#define _MD2CON0_MD2OUT_MASK                                0x20
#define _MD2CON0_MD2EN_POSN                                 0x7
#define _MD2CON0_MD2EN_POSITION                             0x7
#define _MD2CON0_MD2EN_SIZE                                 0x1
#define _MD2CON0_MD2EN_LENGTH                               0x1
#define _MD2CON0_MD2EN_MASK                                 0x80

