MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
extern volatile COG1PHRbits_t COG1PHRbits __at(0x68D);
// bitfield macros
#define _COG1PHR_PHR_POSN                                   0x0
#define _COG1PHR_PHR_POSITION                               0x0
#define _COG1PHR_PHR_SIZE                                   0x6
#define _COG1PHR_PHR_LENGTH                                 0x6
#define _COG1PHR_PHR_MASK                                   0x3F
#define _COG1PHR_PHR0_POSN                                  0x0
#define _COG1PHR_PHR0_POSITION                              0x0
#define _COG1PHR_PHR0_SIZE                                  0x1
#define _COG1PHR_PHR0_LENGTH                                0x1
#define _COG1PHR_PHR0_MASK                                  0x1
#define _COG1PHR_PHR1_POSN                                  0x1
#define _COG1PHR_PHR1_POSITION                              0x1
#define _COG1PHR_PHR1_SIZE                                  0x1
#define _COG1PHR_PHR1_LENGTH                                0x1
#define _COG1PHR_PHR1_MASK                                  0x2
#define _COG1PHR_PHR2_POSN                                  0x2
#define _COG1PHR_PHR2_POSITION                              0x2
#define _COG1PHR_PHR2_SIZE                                  0x1
#define _COG1PHR_PHR2_LENGTH                                0x1
#define _COG1PHR_PHR2_MASK                                  0x4
#define _COG1PHR_PHR3_POSN                                  0x3
#define _COG1PHR_PHR3_POSITION                              0x3
#define _COG1PHR_PHR3_SIZE                                  0x1
#define _COG1PHR_PHR3_LENGTH                                0x1
#define _COG1PHR_PHR3_MASK                                  0x8
#define _COG1PHR_PHR4_POSN                                  0x4
#define _COG1PHR_PHR4_POSITION                              0x4
#define _COG1PHR_PHR4_SIZE                                  0x1
#define _COG1PHR_PHR4_LENGTH                                0x1
#define _COG1PHR_PHR4_MASK                                  0x10
#define _COG1PHR_PHR5_POSN                                  0x5
#define _COG1PHR_PHR5_POSITION                              0x5
#define _COG1PHR_PHR5_SIZE                                  0x1
#define _COG1PHR_PHR5_LENGTH                                0x1
#define _COG1PHR_PHR5_MASK                                  0x20
#define _COG1PHR_G1PHR0_POSN                                0x0
#define _COG1PHR_G1PHR0_POSITION                            0x0
#define _COG1PHR_G1PHR0_SIZE                                0x1
#define _COG1PHR_G1PHR0_LENGTH                              0x1
#define _COG1PHR_G1PHR0_MASK                                0x1
#define _COG1PHR_G1PHR1_POSN                                0x1
#define _COG1PHR_G1PHR1_POSITION                            0x1
#define _COG1PHR_G1PHR1_SIZE                                0x1
#define _COG1PHR_G1PHR1_LENGTH                              0x1
#define _COG1PHR_G1PHR1_MASK                                0x2
#define _COG1PHR_G1PHR2_POSN                                0x2
#define _COG1PHR_G1PHR2_POSITION                            0x2
#define _COG1PHR_G1PHR2_SIZE                                0x1
#define _COG1PHR_G1PHR2_LENGTH                              0x1
#define _COG1PHR_G1PHR2_MASK                                0x4
#define _COG1PHR_G1PHR3_POSN                                0x3
#define _COG1PHR_G1PHR3_POSITION                            0x3
#define _COG1PHR_G1PHR3_SIZE                                0x1
#define _COG1PHR_G1PHR3_LENGTH                              0x1
#define _COG1PHR_G1PHR3_MASK                                0x8
#define _COG1PHR_G1PHR4_POSN                                0x4
#define _COG1PHR_G1PHR4_POSITION                            0x4
#define _COG1PHR_G1PHR4_SIZE                                0x1
#define _COG1PHR_G1PHR4_LENGTH                              0x1
#define _COG1PHR_G1PHR4_MASK                                0x10
#define _COG1PHR_G1PHR5_POSN                                0x5
#define _COG1PHR_G1PHR5_POSITION                            0x5
#define _COG1PHR_G1PHR5_SIZE                                0x1
#define _COG1PHR_G1PHR5_LENGTH                              0x1
#define _COG1PHR_G1PHR5_MASK                                0x20

// Register: COG1PHF
#define COG1PHF COG1PHF
extern volatile unsigned char           COG1PHF             __at(0x68E);
#ifndef _LIB_BUILD
asm("COG1PHF equ 068Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHF                    :6;
    };
    struct {
        unsigned PHF0                   :1;
        unsigned PHF1                   :1;
        unsigned PHF2                   :1;
        unsigned PHF3                   :1;
        unsigned PHF4                   :1;
        unsigned PHF5                   :1;
    };
    struct {
        unsigned G1PHF0                 :1;
        unsigned G1PHF1                 :1;
        unsigned G1PHF2                 :1;
        unsigned G1PHF3                 :1;
        unsigned G1PHF4                 :1;
        unsigned G1PHF5                 :1;
    };
} COG1PHFbits_t;
extern volatile COG1PHFbits_t COG1PHFbits __at(0x68E);
// bitfield macros
#define _COG1PHF_PHF_POSN                                   0x0
#define _COG1PHF_PHF_POSITION                               0x0
#define _COG1PHF_PHF_SIZE                                   0x6
#define _COG1PHF_PHF_LENGTH                                 0x6
#define _COG1PHF_PHF_MASK                                   0x3F
#define _COG1PHF_PHF0_POSN                                  0x0
#define _COG1PHF_PHF0_POSITION                              0x0
#define _COG1PHF_PHF0_SIZE                                  0x1
#define _COG1PHF_PHF0_LENGTH                                0x1
#define _COG1PHF_PHF0_MASK                                  0x1
#define _COG1PHF_PHF1_POSN                                  0x1
#define _COG1PHF_PHF1_POSITION                              0x1
#define _COG1PHF_PHF1_SIZE                                  0x1
#define _COG1PHF_PHF1_LENGTH                                0x1
#define _COG1PHF_PHF1_MASK                                  0x2
#define _COG1PHF_PHF2_POSN                                  0x2
#define _COG1PHF_PHF2_POSITION                              0x2
#define _COG1PHF_PHF2_SIZE                                  0x1
#define _COG1PHF_PHF2_LENGTH                                0x1
#define _COG1PHF_PHF2_MASK                                  0x4
#define _COG1PHF_PHF3_POSN                                  0x3
#define _COG1PHF_PHF3_POSITION                              0x3
#define _COG1PHF_PHF3_SIZE                                  0x1
#define _COG1PHF_PHF3_LENGTH                                0x1
#define _COG1PHF_PHF3_MASK                                  0x8
#define _COG1PHF_PHF4_POSN                                  0x4
#define _COG1PHF_PHF4_POSITION                              0x4
#define _COG1PHF_PHF4_SIZE                                  0x1
#define _COG1PHF_PHF4_LENGTH                                0x1
#define _COG1PHF_PHF4_MASK                                  0x10
#define _COG1PHF_PHF5_POSN                                  0x5
#define _COG1PHF_PHF5_POSITION                              0x5
#define _COG1PHF_PHF5_SIZE                                  0x1
#define _COG1PHF_PHF5_LENGTH                                0x1
#define _COG1PHF_PHF5_MASK                                  0x20
#define _COG1PHF_G1PHF0_POSN                                0x0
#define _COG1PHF_G1PHF0_POSITION                            0x0
#define _COG1PHF_G1PHF0_SIZE                                0x1
#define _COG1PHF_G1PHF0_LENGTH                              0x1
#define _COG1PHF_G1PHF0_MASK                                0x1
#define _COG1PHF_G1PHF1_POSN                                0x1
#define _COG1PHF_G1PHF1_POSITION                            0x1
#define _COG1PHF_G1PHF1_SIZE                                0x1
#define _COG1PHF_G1PHF1_LENGTH                              0x1
#define _COG1PHF_G1PHF1_MASK                                0x2
#define _COG1PHF_G1PHF2_POSN                                0x2
#define _COG1PHF_G1PHF2_POSITION                            0x2
#define _COG1PHF_G1PHF2_SIZE                                0x1
#define _COG1PHF_G1PHF2_LENGTH                              0x1
#define _COG1PHF_G1PHF2_MASK                                0x4
#define _COG1PHF_G1PHF3_POSN                                0x3
#define _COG1PHF_G1PHF3_POSITION                            0x3
#define _COG1PHF_G1PHF3_SIZE                                0x1
#define _COG1PHF_G1PHF3_LENGTH                              0x1
#define _COG1PHF_G1PHF3_MASK                                0x8
#define _COG1PHF_G1PHF4_POSN                                0x4
#define _COG1PHF_G1PHF4_POSITION                            0x4
#define _COG1PHF_G1PHF4_SIZE                                0x1
#define _COG1PHF_G1PHF4_LENGTH                              0x1
#define _COG1PHF_G1PHF4_MASK                                0x10
#define _COG1PHF_G1PHF5_POSN                                0x5
#define _COG1PHF_G1PHF5_POSITION                            0x5
#define _COG1PHF_G1PHF5_SIZE                                0x1
#define _COG1PHF_G1PHF5_LENGTH                              0x1
#define _COG1PHF_G1PHF5_MASK                                0x20

