MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
extern volatile COG2DBFbits_t COG2DBFbits __at(0x712);
// bitfield macros
#define _COG2DBF_DBF0_POSN                                  0x0
#define _COG2DBF_DBF0_POSITION                              0x0
#define _COG2DBF_DBF0_SIZE                                  0x1
#define _COG2DBF_DBF0_LENGTH                                0x1
#define _COG2DBF_DBF0_MASK                                  0x1
#define _COG2DBF_DBF1_POSN                                  0x1
#define _COG2DBF_DBF1_POSITION                              0x1
#define _COG2DBF_DBF1_SIZE                                  0x1
#define _COG2DBF_DBF1_LENGTH                                0x1
#define _COG2DBF_DBF1_MASK                                  0x2
#define _COG2DBF_DBF2_POSN                                  0x2
#define _COG2DBF_DBF2_POSITION                              0x2
#define _COG2DBF_DBF2_SIZE                                  0x1
#define _COG2DBF_DBF2_LENGTH                                0x1
#define _COG2DBF_DBF2_MASK                                  0x4
#define _COG2DBF_DBF3_POSN                                  0x3
#define _COG2DBF_DBF3_POSITION                              0x3
#define _COG2DBF_DBF3_SIZE                                  0x1
#define _COG2DBF_DBF3_LENGTH                                0x1
#define _COG2DBF_DBF3_MASK                                  0x8
#define _COG2DBF_DBF4_POSN                                  0x4
#define _COG2DBF_DBF4_POSITION                              0x4
#define _COG2DBF_DBF4_SIZE                                  0x1
#define _COG2DBF_DBF4_LENGTH                                0x1
#define _COG2DBF_DBF4_MASK                                  0x10
#define _COG2DBF_DBF5_POSN                                  0x5
#define _COG2DBF_DBF5_POSITION                              0x5
#define _COG2DBF_DBF5_SIZE                                  0x1
#define _COG2DBF_DBF5_LENGTH                                0x1
#define _COG2DBF_DBF5_MASK                                  0x20
#define _COG2DBF_G2DBF0_POSN                                0x0
#define _COG2DBF_G2DBF0_POSITION                            0x0
#define _COG2DBF_G2DBF0_SIZE                                0x1
#define _COG2DBF_G2DBF0_LENGTH                              0x1
#define _COG2DBF_G2DBF0_MASK                                0x1
#define _COG2DBF_G2DBF1_POSN                                0x1
#define _COG2DBF_G2DBF1_POSITION                            0x1
#define _COG2DBF_G2DBF1_SIZE                                0x1
#define _COG2DBF_G2DBF1_LENGTH                              0x1
#define _COG2DBF_G2DBF1_MASK                                0x2
#define _COG2DBF_G2DBF2_POSN                                0x2
#define _COG2DBF_G2DBF2_POSITION                            0x2
#define _COG2DBF_G2DBF2_SIZE                                0x1
#define _COG2DBF_G2DBF2_LENGTH                              0x1
#define _COG2DBF_G2DBF2_MASK                                0x4
#define _COG2DBF_G2DBF3_POSN                                0x3
#define _COG2DBF_G2DBF3_POSITION                            0x3
#define _COG2DBF_G2DBF3_SIZE                                0x1
#define _COG2DBF_G2DBF3_LENGTH                              0x1
#define _COG2DBF_G2DBF3_MASK                                0x8
#define _COG2DBF_G2DBF4_POSN                                0x4
#define _COG2DBF_G2DBF4_POSITION                            0x4
#define _COG2DBF_G2DBF4_SIZE                                0x1
#define _COG2DBF_G2DBF4_LENGTH                              0x1
#define _COG2DBF_G2DBF4_MASK                                0x10
#define _COG2DBF_G2DBF5_POSN                                0x5
#define _COG2DBF_G2DBF5_POSITION                            0x5
#define _COG2DBF_G2DBF5_SIZE                                0x1
#define _COG2DBF_G2DBF5_LENGTH                              0x1
#define _COG2DBF_G2DBF5_MASK                                0x20
#define _COG2DBF_G2DBF_POSN                                 0x0
#define _COG2DBF_G2DBF_POSITION                             0x0
#define _COG2DBF_G2DBF_SIZE                                 0x6
#define _COG2DBF_G2DBF_LENGTH                               0x6
#define _COG2DBF_G2DBF_MASK                                 0x3F

// Register: COG2CON0
#define COG2CON0 COG2CON0
extern volatile unsigned char           COG2CON0            __at(0x713);
#ifndef _LIB_BUILD
asm("COG2CON0 equ 0713h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD                     :3;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD0                    :1;
        unsigned MD1                    :1;
        unsigned MD2                    :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned G2MD                   :3;
        unsigned G2CS                   :2;
        unsigned                        :1;
        unsigned G2LD                   :1;
        unsigned G2EN                   :1;
    };
    struct {
        unsigned G2MD0                  :1;
        unsigned G2MD1                  :1;
        unsigned G2MD2                  :1;
        unsigned G2CS0                  :1;
        unsigned G2CS1                  :1;
    };
} COG2CON0bits_t;
extern volatile COG2CON0bits_t COG2CON0bits __at(0x713);
// bitfield macros
#define _COG2CON0_MD_POSN                                   0x0
#define _COG2CON0_MD_POSITION                               0x0
#define _COG2CON0_MD_SIZE                                   0x3
#define _COG2CON0_MD_LENGTH                                 0x3
#define _COG2CON0_MD_MASK                                   0x7
#define _COG2CON0_CS_POSN                                   0x3
#define _COG2CON0_CS_POSITION                               0x3
#define _COG2CON0_CS_SIZE                                   0x2
#define _COG2CON0_CS_LENGTH                                 0x2
#define _COG2CON0_CS_MASK                                   0x18
#define _COG2CON0_LD_POSN                                   0x6
#define _COG2CON0_LD_POSITION                               0x6
#define _COG2CON0_LD_SIZE                                   0x1
#define _COG2CON0_LD_LENGTH                                 0x1
#define _COG2CON0_LD_MASK                                   0x40
#define _COG2CON0_EN_POSN                                   0x7
#define _COG2CON0_EN_POSITION                               0x7
#define _COG2CON0_EN_SIZE                                   0x1
#define _COG2CON0_EN_LENGTH                                 0x1
#define _COG2CON0_EN_MASK                                   0x80
#define _COG2CON0_MD0_POSN                                  0x0
#define _COG2CON0_MD0_POSITION                              0x0
#define _COG2CON0_MD0_SIZE                                  0x1
#define _COG2CON0_MD0_LENGTH                                0x1
#define _COG2CON0_MD0_MASK                                  0x1
#define _COG2CON0_MD1_POSN                                  0x1
#define _COG2CON0_MD1_POSITION                              0x1
#define _COG2CON0_MD1_SIZE                                  0x1
#define _COG2CON0_MD1_LENGTH                                0x1
#define _COG2CON0_MD1_MASK                                  0x2
#define _COG2CON0_MD2_POSN                                  0x2
#define _COG2CON0_MD2_POSITION                              0x2
#define _COG2CON0_MD2_SIZE                                  0x1
#define _COG2CON0_MD2_LENGTH                                0x1
#define _COG2CON0_MD2_MASK                                  0x4
#define _COG2CON0_CS0_POSN                                  0x3
#define _COG2CON0_CS0_POSITION                              0x3
#define _COG2CON0_CS0_SIZE                                  0x1
#define _COG2CON0_CS0_LENGTH                                0x1
#define _COG2CON0_CS0_MASK                                  0x8
#define _COG2CON0_CS1_POSN                                  0x4
#define _COG2CON0_CS1_POSITION                              0x4
#define _COG2CON0_CS1_SIZE                                  0x1
#define _COG2CON0_CS1_LENGTH                                0x1
#define _COG2CON0_CS1_MASK                                  0x10
#define _COG2CON0_G2MD_POSN                                 0x0
#define _COG2CON0_G2MD_POSITION                             0x0
#define _COG2CON0_G2MD_SIZE                                 0x3
#define _COG2CON0_G2MD_LENGTH                               0x3
#define _COG2CON0_G2MD_MASK                                 0x7
#define _COG2CON0_G2CS_POSN                                 0x3
#define _COG2CON0_G2CS_POSITION                             0x3
#define _COG2CON0_G2CS_SIZE                                 0x2
#define _COG2CON0_G2CS_LENGTH                               0x2
#define _COG2CON0_G2CS_MASK                                 0x18
#define _COG2CON0_G2LD_POSN                                 0x6
#define _COG2CON0_G2LD_POSITION                             0x6
#define _COG2CON0_G2LD_SIZE                                 0x1
#define _COG2CON0_G2LD_LENGTH                               0x1
#define _COG2CON0_G2LD_MASK                                 0x40
#define _COG2CON0_G2EN_POSN                                 0x7
#define _COG2CON0_G2EN_POSITION                             0x7
#define _COG2CON0_G2EN_SIZE                                 0x1
#define _COG2CON0_G2EN_LENGTH                               0x1
#define _COG2CON0_G2EN_MASK                                 0x80
#define _COG2CON0_G2MD0_POSN                                0x0
#define _COG2CON0_G2MD0_POSITION                            0x0
#define _COG2CON0_G2MD0_SIZE                                0x1
#define _COG2CON0_G2MD0_LENGTH                              0x1
#define _COG2CON0_G2MD0_MASK                                0x1
#define _COG2CON0_G2MD1_POSN                                0x1
#define _COG2CON0_G2MD1_POSITION                            0x1
#define _COG2CON0_G2MD1_SIZE                                0x1
#define _COG2CON0_G2MD1_LENGTH                              0x1
#define _COG2CON0_G2MD1_MASK                                0x2
#define _COG2CON0_G2MD2_POSN                                0x2
#define _COG2CON0_G2MD2_POSITION                            0x2
#define _COG2CON0_G2MD2_SIZE                                0x1
#define _COG2CON0_G2MD2_LENGTH                              0x1
#define _COG2CON0_G2MD2_MASK                                0x4
#define _COG2CON0_G2CS0_POSN                                0x3
#define _COG2CON0_G2CS0_POSITION                            0x3
#define _COG2CON0_G2CS0_SIZE                                0x1
#define _COG2CON0_G2CS0_LENGTH                              0x1
#define _COG2CON0_G2CS0_MASK                                0x8
#define _COG2CON0_G2CS1_POSN                                0x4
#define _COG2CON0_G2CS1_POSITION                            0x4
#define _COG2CON0_G2CS1_SIZE                                0x1
#define _COG2CON0_G2CS1_LENGTH                              0x1
#define _COG2CON0_G2CS1_MASK                                0x10

// Register: COG2CON1
#define COG2CON1 COG2CON1
extern volatile unsigned char           COG2CON1            __at(0x714);
#ifndef _LIB_BUILD
asm("COG2CON1 equ 0714h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :2;
        unsigned FDBS                   :1;
        unsigned RDBS                   :1;
    };
    struct {
        unsigned G2POLA                 :1;
        unsigned G2POLB                 :1;
        unsigned G2POLC                 :1;
        unsigned G2POLD                 :1;
        unsigned                        :2;
        unsigned G2FDBS                 :1;
        unsigned G2RDBS                 :1;
    };
} COG2CON1bits_t;
extern volatile COG2CON1bits_t COG2CON1bits __at(0x714);
// bitfield macros
#define _COG2CON1_POLA_POSN                                 0x0
#define _COG2CON1_POLA_POSITION                             0x0
#define _COG2CON1_POLA_SIZE                                 0x1
#define _COG2CON1_POLA_LENGTH                               0x1
#define _COG2CON1_POLA_MASK                                 0x1
#define _COG2CON1_POLB_POSN                                 0x1
#define _COG2CON1_POLB_POSITION                             0x1
#define _COG2CON1_POLB_SIZE                                 0x1
#define _COG2CON1_POLB_LENGTH                               0x1
#define _COG2CON1_POLB_MASK                                 0x2
#define _COG2CON1_POLC_POSN                                 0x2
#define _COG2CON1_POLC_POSITION                             0x2
#define _COG2CON1_POLC_SIZE                                 0x1
#define _COG2CON1_POLC_LENGTH                               0x1
#define _COG2CON1_POLC_MASK                                 0x4
#define _COG2CON1_POLD_POSN                                 0x3
#define _COG2CON1_POLD_POSITION                             0x3
#define _COG2CON1_POLD_SIZE                                 0x1
#define _COG2CON1_POLD_LENGTH                               0x1
#define _COG2CON1_POLD_MASK                                 0x8
#define _COG2CON1_FDBS_POSN                                 0x6
#define _COG2CON1_FDBS_POSITION                             0x6
#define _COG2CON1_FDBS_SIZE                                 0x1
#define _COG2CON1_FDBS_LENGTH                               0x1
#define _COG2CON1_FDBS_MASK                                 0x40
#define _COG2CON1_RDBS_POSN                                 0x7
#define _COG2CON1_RDBS_POSITION                             0x7
#define _COG2CON1_RDBS_SIZE                                 0x1
#define _COG2CON1_RDBS_LENGTH                               0x1
#define _COG2CON1_RDBS_MASK                                 0x80
#define _COG2CON1_G2POLA_POSN                               0x0
#define _COG2CON1_G2POLA_POSITION                           0x0
#define _COG2CON1_G2POLA_SIZE                               0x1
#define _COG2CON1_G2POLA_LENGTH                             0x1
#define _COG2CON1_G2POLA_MASK                               0x1
#define _COG2CON1_G2POLB_POSN                               0x1
#define _COG2CON1_G2POLB_POSITION                           0x1
#define _COG2CON1_G2POLB_SIZE                               0x1
#define _COG2CON1_G2POLB_LENGTH                             0x1
#define _COG2CON1_G2POLB_MASK                               0x2
#define _COG2CON1_G2POLC_POSN                               0x2
#define _COG2CON1_G2POLC_POSITION                           0x2
#define _COG2CON1_G2POLC_SIZE                               0x1
#define _COG2CON1_G2POLC_LENGTH                             0x1
#define _COG2CON1_G2POLC_MASK                               0x4
#define _COG2CON1_G2POLD_POSN                               0x3
#define _COG2CON1_G2POLD_POSITION                           0x3
#define _COG2CON1_G2POLD_SIZE                               0x1
#define _COG2CON1_G2POLD_LENGTH                             0x1
#define _COG2CON1_G2POLD_MASK                               0x8
#define _COG2CON1_G2FDBS_POSN                               0x6
#define _COG2CON1_G2FDBS_POSITION                           0x6
#define _COG2CON1_G2FDBS_SIZE                               0x1
#define _COG2CON1_G2FDBS_LENGTH                             0x1
#define _COG2CON1_G2FDBS_MASK                               0x40
#define _COG2CON1_G2RDBS_POSN                               0x7
#define _COG2CON1_G2RDBS_POSITION                           0x7
#define _COG2CON1_G2RDBS_SIZE                               0x1
#define _COG2CON1_G2RDBS_LENGTH                             0x1
#define _COG2CON1_G2RDBS_MASK                               0x80

// Register: COG2RIS0
#define COG2RIS0 COG2RIS0
extern volatile unsigned char           COG2RIS0            __at(0x715);
#ifndef _LIB_BUILD
asm("COG2RIS0 equ 0715h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS0                   :1;
        unsigned RIS1                   :1;
        unsigned RIS2                   :1;
        unsigned RIS3                   :1;
        unsigned RIS4                   :1;
        unsigned RIS5                   :1;
        unsigned RIS6                   :1;
        unsigned RIS7                   :1;
    };
    struct {
        unsigned G2RIS0                 :1;
        unsigned G2RIS1                 :1;
        unsigned G2RIS2                 :1;
        unsigned G2RIS3                 :1;
        unsigned G2RIS4                 :1;
        unsigned G2RIS5                 :1;
        unsigned G2RIS6                 :1;
        unsigned G2RIS7                 :1;
    };
} COG2RIS0bits_t;
