MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
// Register: PRG2INS
#define PRG2INS PRG2INS
extern volatile unsigned char           PRG2INS             __at(0x796);
#ifndef _LIB_BUILD
asm("PRG2INS equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INS                    :8;
    };
    struct {
        unsigned INS0                   :1;
        unsigned INS1                   :1;
        unsigned INS2                   :1;
        unsigned INS3                   :1;
    };
    struct {
        unsigned RG2INS0                :1;
        unsigned RG2INS1                :1;
        unsigned RG2INS2                :1;
        unsigned RG2INS3                :1;
    };
} PRG2INSbits_t;
extern volatile PRG2INSbits_t PRG2INSbits __at(0x796);
// bitfield macros
#define _PRG2INS_INS_POSN                                   0x0
#define _PRG2INS_INS_POSITION                               0x0
#define _PRG2INS_INS_SIZE                                   0x8
#define _PRG2INS_INS_LENGTH                                 0x8
#define _PRG2INS_INS_MASK                                   0xFF
#define _PRG2INS_INS0_POSN                                  0x0
#define _PRG2INS_INS0_POSITION                              0x0
#define _PRG2INS_INS0_SIZE                                  0x1
#define _PRG2INS_INS0_LENGTH                                0x1
#define _PRG2INS_INS0_MASK                                  0x1
#define _PRG2INS_INS1_POSN                                  0x1
#define _PRG2INS_INS1_POSITION                              0x1
#define _PRG2INS_INS1_SIZE                                  0x1
#define _PRG2INS_INS1_LENGTH                                0x1
#define _PRG2INS_INS1_MASK                                  0x2
#define _PRG2INS_INS2_POSN                                  0x2
#define _PRG2INS_INS2_POSITION                              0x2
#define _PRG2INS_INS2_SIZE                                  0x1
#define _PRG2INS_INS2_LENGTH                                0x1
#define _PRG2INS_INS2_MASK                                  0x4
#define _PRG2INS_INS3_POSN                                  0x3
#define _PRG2INS_INS3_POSITION                              0x3
#define _PRG2INS_INS3_SIZE                                  0x1
#define _PRG2INS_INS3_LENGTH                                0x1
#define _PRG2INS_INS3_MASK                                  0x8
#define _PRG2INS_RG2INS0_POSN                               0x0
#define _PRG2INS_RG2INS0_POSITION                           0x0
#define _PRG2INS_RG2INS0_SIZE                               0x1
#define _PRG2INS_RG2INS0_LENGTH                             0x1
#define _PRG2INS_RG2INS0_MASK                               0x1
#define _PRG2INS_RG2INS1_POSN                               0x1
#define _PRG2INS_RG2INS1_POSITION                           0x1
#define _PRG2INS_RG2INS1_SIZE                               0x1
#define _PRG2INS_RG2INS1_LENGTH                             0x1
#define _PRG2INS_RG2INS1_MASK                               0x2
#define _PRG2INS_RG2INS2_POSN                               0x2
#define _PRG2INS_RG2INS2_POSITION                           0x2
#define _PRG2INS_RG2INS2_SIZE                               0x1
#define _PRG2INS_RG2INS2_LENGTH                             0x1
#define _PRG2INS_RG2INS2_MASK                               0x4
#define _PRG2INS_RG2INS3_POSN                               0x3
#define _PRG2INS_RG2INS3_POSITION                           0x3
#define _PRG2INS_RG2INS3_SIZE                               0x1
#define _PRG2INS_RG2INS3_LENGTH                             0x1
#define _PRG2INS_RG2INS3_MASK                               0x8

// Register: PRG2CON0
#define PRG2CON0 PRG2CON0
extern volatile unsigned char           PRG2CON0            __at(0x797);
#ifndef _LIB_BUILD
asm("PRG2CON0 equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
        unsigned OS                     :1;
        unsigned MODE                   :2;
        unsigned REDG                   :1;
        unsigned FEDG                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
    struct {
        unsigned RG2GO                  :1;
        unsigned RG2OS                  :1;
        unsigned RG2MODE                :2;
        unsigned RG2REDG                :1;
        unsigned RG2FEDG                :1;
        unsigned                        :1;
        unsigned RG2EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RG2MODE0               :1;
        unsigned RG2MODE1               :1;
    };
} PRG2CON0bits_t;
extern volatile PRG2CON0bits_t PRG2CON0bits __at(0x797);
// bitfield macros
#define _PRG2CON0_GO_POSN                                   0x0
#define _PRG2CON0_GO_POSITION                               0x0
#define _PRG2CON0_GO_SIZE                                   0x1
#define _PRG2CON0_GO_LENGTH                                 0x1
#define _PRG2CON0_GO_MASK                                   0x1
#define _PRG2CON0_OS_POSN                                   0x1
#define _PRG2CON0_OS_POSITION                               0x1
#define _PRG2CON0_OS_SIZE                                   0x1
#define _PRG2CON0_OS_LENGTH                                 0x1
#define _PRG2CON0_OS_MASK                                   0x2
#define _PRG2CON0_MODE_POSN                                 0x2
#define _PRG2CON0_MODE_POSITION                             0x2
#define _PRG2CON0_MODE_SIZE                                 0x2
#define _PRG2CON0_MODE_LENGTH                               0x2
#define _PRG2CON0_MODE_MASK                                 0xC
#define _PRG2CON0_REDG_POSN                                 0x4
#define _PRG2CON0_REDG_POSITION                             0x4
#define _PRG2CON0_REDG_SIZE                                 0x1
#define _PRG2CON0_REDG_LENGTH                               0x1
#define _PRG2CON0_REDG_MASK                                 0x10
#define _PRG2CON0_FEDG_POSN                                 0x5
#define _PRG2CON0_FEDG_POSITION                             0x5
#define _PRG2CON0_FEDG_SIZE                                 0x1
#define _PRG2CON0_FEDG_LENGTH                               0x1
#define _PRG2CON0_FEDG_MASK                                 0x20
#define _PRG2CON0_EN_POSN                                   0x7
#define _PRG2CON0_EN_POSITION                               0x7
#define _PRG2CON0_EN_SIZE                                   0x1
#define _PRG2CON0_EN_LENGTH                                 0x1
#define _PRG2CON0_EN_MASK                                   0x80
#define _PRG2CON0_MODE0_POSN                                0x2
#define _PRG2CON0_MODE0_POSITION                            0x2
#define _PRG2CON0_MODE0_SIZE                                0x1
#define _PRG2CON0_MODE0_LENGTH                              0x1
#define _PRG2CON0_MODE0_MASK                                0x4
#define _PRG2CON0_MODE1_POSN                                0x3
#define _PRG2CON0_MODE1_POSITION                            0x3
#define _PRG2CON0_MODE1_SIZE                                0x1
#define _PRG2CON0_MODE1_LENGTH                              0x1
#define _PRG2CON0_MODE1_MASK                                0x8
#define _PRG2CON0_RG2GO_POSN                                0x0
#define _PRG2CON0_RG2GO_POSITION                            0x0
#define _PRG2CON0_RG2GO_SIZE                                0x1
#define _PRG2CON0_RG2GO_LENGTH                              0x1
#define _PRG2CON0_RG2GO_MASK                                0x1
#define _PRG2CON0_RG2OS_POSN                                0x1
#define _PRG2CON0_RG2OS_POSITION                            0x1
#define _PRG2CON0_RG2OS_SIZE                                0x1
#define _PRG2CON0_RG2OS_LENGTH                              0x1
#define _PRG2CON0_RG2OS_MASK                                0x2
#define _PRG2CON0_RG2MODE_POSN                              0x2
#define _PRG2CON0_RG2MODE_POSITION                          0x2
#define _PRG2CON0_RG2MODE_SIZE                              0x2
#define _PRG2CON0_RG2MODE_LENGTH                            0x2
#define _PRG2CON0_RG2MODE_MASK                              0xC
#define _PRG2CON0_RG2REDG_POSN                              0x4
#define _PRG2CON0_RG2REDG_POSITION                          0x4
#define _PRG2CON0_RG2REDG_SIZE                              0x1
#define _PRG2CON0_RG2REDG_LENGTH                            0x1
#define _PRG2CON0_RG2REDG_MASK                              0x10
#define _PRG2CON0_RG2FEDG_POSN                              0x5
#define _PRG2CON0_RG2FEDG_POSITION                          0x5
#define _PRG2CON0_RG2FEDG_SIZE                              0x1
#define _PRG2CON0_RG2FEDG_LENGTH                            0x1
#define _PRG2CON0_RG2FEDG_MASK                              0x20
#define _PRG2CON0_RG2EN_POSN                                0x7
#define _PRG2CON0_RG2EN_POSITION                            0x7
#define _PRG2CON0_RG2EN_SIZE                                0x1
#define _PRG2CON0_RG2EN_LENGTH                              0x1
#define _PRG2CON0_RG2EN_MASK                                0x80
#define _PRG2CON0_RG2MODE0_POSN                             0x2
#define _PRG2CON0_RG2MODE0_POSITION                         0x2
#define _PRG2CON0_RG2MODE0_SIZE                             0x1
#define _PRG2CON0_RG2MODE0_LENGTH                           0x1
#define _PRG2CON0_RG2MODE0_MASK                             0x4
#define _PRG2CON0_RG2MODE1_POSN                             0x3
#define _PRG2CON0_RG2MODE1_POSITION                         0x3
#define _PRG2CON0_RG2MODE1_SIZE                             0x1
#define _PRG2CON0_RG2MODE1_LENGTH                           0x1
#define _PRG2CON0_RG2MODE1_MASK                             0x8

// Register: PRG2CON1
#define PRG2CON1 PRG2CON1
extern volatile unsigned char           PRG2CON1            __at(0x798);
#ifndef _LIB_BUILD
asm("PRG2CON1 equ 0798h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOL                   :1;
        unsigned FPOL                   :1;
        unsigned RDY                    :1;
    };
    struct {
        unsigned RG2RPOL                :1;
        unsigned RG2FPOL                :1;
        unsigned RG2RDY                 :1;
    };
} PRG2CON1bits_t;
extern volatile PRG2CON1bits_t PRG2CON1bits __at(0x798);
// bitfield macros
#define _PRG2CON1_RPOL_POSN                                 0x0
#define _PRG2CON1_RPOL_POSITION                             0x0
#define _PRG2CON1_RPOL_SIZE                                 0x1
#define _PRG2CON1_RPOL_LENGTH                               0x1
#define _PRG2CON1_RPOL_MASK                                 0x1
#define _PRG2CON1_FPOL_POSN                                 0x1
#define _PRG2CON1_FPOL_POSITION                             0x1
#define _PRG2CON1_FPOL_SIZE                                 0x1
#define _PRG2CON1_FPOL_LENGTH                               0x1
#define _PRG2CON1_FPOL_MASK                                 0x2
#define _PRG2CON1_RDY_POSN                                  0x2
#define _PRG2CON1_RDY_POSITION                              0x2
#define _PRG2CON1_RDY_SIZE                                  0x1
#define _PRG2CON1_RDY_LENGTH                                0x1
#define _PRG2CON1_RDY_MASK                                  0x4
#define _PRG2CON1_RG2RPOL_POSN                              0x0
#define _PRG2CON1_RG2RPOL_POSITION                          0x0
#define _PRG2CON1_RG2RPOL_SIZE                              0x1
#define _PRG2CON1_RG2RPOL_LENGTH                            0x1
#define _PRG2CON1_RG2RPOL_MASK                              0x1
#define _PRG2CON1_RG2FPOL_POSN                              0x1
#define _PRG2CON1_RG2FPOL_POSITION                          0x1
#define _PRG2CON1_RG2FPOL_SIZE                              0x1
#define _PRG2CON1_RG2FPOL_LENGTH                            0x1
#define _PRG2CON1_RG2FPOL_MASK                              0x2
#define _PRG2CON1_RG2RDY_POSN                               0x2
#define _PRG2CON1_RG2RDY_POSITION                           0x2
#define _PRG2CON1_RG2RDY_SIZE                               0x1
#define _PRG2CON1_RG2RDY_LENGTH                             0x1
#define _PRG2CON1_RG2RDY_MASK                               0x4

// Register: PRG2CON2
#define PRG2CON2 PRG2CON2
extern volatile unsigned char           PRG2CON2            __at(0x799);
#ifndef _LIB_BUILD
asm("PRG2CON2 equ 0799h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISET                   :5;
    };
    struct {
        unsigned ISET0                  :1;
        unsigned ISET1                  :1;
        unsigned ISET2                  :1;
        unsigned ISET3                  :1;
        unsigned ISET4                  :1;
    };
    struct {
        unsigned RG2ISET                :5;
    };
    struct {
        unsigned RG2ISET0               :1;
        unsigned RG2ISET1               :1;
        unsigned RG2ISET2               :1;
        unsigned RG2ISET3               :1;
        unsigned RG2ISET4               :1;
    };
} PRG2CON2bits_t;
extern volatile PRG2CON2bits_t PRG2CON2bits __at(0x799);
// bitfield macros
#define _PRG2CON2_ISET_POSN                                 0x0
#define _PRG2CON2_ISET_POSITION                             0x0
#define _PRG2CON2_ISET_SIZE                                 0x5
#define _PRG2CON2_ISET_LENGTH                               0x5
#define _PRG2CON2_ISET_MASK                                 0x1F
#define _PRG2CON2_ISET0_POSN                                0x0
#define _PRG2CON2_ISET0_POSITION                            0x0
#define _PRG2CON2_ISET0_SIZE                                0x1
#define _PRG2CON2_ISET0_LENGTH                              0x1
#define _PRG2CON2_ISET0_MASK                                0x1
#define _PRG2CON2_ISET1_POSN                                0x1
#define _PRG2CON2_ISET1_POSITION                            0x1
#define _PRG2CON2_ISET1_SIZE                                0x1
#define _PRG2CON2_ISET1_LENGTH                              0x1
#define _PRG2CON2_ISET1_MASK                                0x2
#define _PRG2CON2_ISET2_POSN                                0x2
#define _PRG2CON2_ISET2_POSITION                            0x2
#define _PRG2CON2_ISET2_SIZE                                0x1
#define _PRG2CON2_ISET2_LENGTH                              0x1
#define _PRG2CON2_ISET2_MASK                                0x4
#define _PRG2CON2_ISET3_POSN                                0x3
#define _PRG2CON2_ISET3_POSITION                            0x3
#define _PRG2CON2_ISET3_SIZE                                0x1
#define _PRG2CON2_ISET3_LENGTH                              0x1
#define _PRG2CON2_ISET3_MASK                                0x8
#define _PRG2CON2_ISET4_POSN                                0x4
#define _PRG2CON2_ISET4_POSITION                            0x4
#define _PRG2CON2_ISET4_SIZE                                0x1
#define _PRG2CON2_ISET4_LENGTH                              0x1
#define _PRG2CON2_ISET4_MASK                                0x10
#define _PRG2CON2_RG2ISET_POSN                              0x0
#define _PRG2CON2_RG2ISET_POSITION                          0x0
#define _PRG2CON2_RG2ISET_SIZE                              0x5
#define _PRG2CON2_RG2ISET_LENGTH                            0x5
#define _PRG2CON2_RG2ISET_MASK                              0x1F
#define _PRG2CON2_RG2ISET0_POSN                             0x0
#define _PRG2CON2_RG2ISET0_POSITION                         0x0
#define _PRG2CON2_RG2ISET0_SIZE                             0x1
#define _PRG2CON2_RG2ISET0_LENGTH                           0x1
#define _PRG2CON2_RG2ISET0_MASK                             0x1
#define _PRG2CON2_RG2ISET1_POSN                             0x1
#define _PRG2CON2_RG2ISET1_POSITION                         0x1
#define _PRG2CON2_RG2ISET1_SIZE                             0x1
#define _PRG2CON2_RG2ISET1_LENGTH                           0x1
#define _PRG2CON2_RG2ISET1_MASK                             0x2
#define _PRG2CON2_RG2ISET2_POSN                             0x2
#define _PRG2CON2_RG2ISET2_POSITION                         0x2
#define _PRG2CON2_RG2ISET2_SIZE                             0x1
#define _PRG2CON2_RG2ISET2_LENGTH                           0x1
#define _PRG2CON2_RG2ISET2_MASK                             0x4
#define _PRG2CON2_RG2ISET3_POSN                             0x3
#define _PRG2CON2_RG2ISET3_POSITION                         0x3
#define _PRG2CON2_RG2ISET3_SIZE                             0x1
#define _PRG2CON2_RG2ISET3_LENGTH                           0x1
#define _PRG2CON2_RG2ISET3_MASK                             0x8
#define _PRG2CON2_RG2ISET4_POSN                             0x4
#define _PRG2CON2_RG2ISET4_POSITION                         0x4
#define _PRG2CON2_RG2ISET4_SIZE                             0x1
#define _PRG2CON2_RG2ISET4_LENGTH                           0x1
#define _PRG2CON2_RG2ISET4_MASK                             0x10

// Register: PRG3RTSS
#define PRG3RTSS PRG3RTSS
extern volatile unsigned char           PRG3RTSS            __at(0x79A);
#ifndef _LIB_BUILD
asm("PRG3RTSS equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTSS                   :8;
    };
    struct {
        unsigned RTSS0                  :1;
        unsigned RTSS1                  :1;
        unsigned RTSS2                  :1;
        unsigned RTSS3                  :1;
    };
    struct {
        unsigned RG3RTSS0               :1;
        unsigned RG3RTSS1               :1;
        unsigned RG3RTSS2               :1;
        unsigned RG3RTSS3               :1;
    };
} PRG3RTSSbits_t;
extern volatile PRG3RTSSbits_t PRG3RTSSbits __at(0x79A);
// bitfield macros
#define _PRG3RTSS_RTSS_POSN                                 0x0
#define _PRG3RTSS_RTSS_POSITION                             0x0
#define _PRG3RTSS_RTSS_SIZE                                 0x8
#define _PRG3RTSS_RTSS_LENGTH                               0x8
#define _PRG3RTSS_RTSS_MASK                                 0xFF
#define _PRG3RTSS_RTSS0_POSN                                0x0
#define _PRG3RTSS_RTSS0_POSITION                            0x0
#define _PRG3RTSS_RTSS0_SIZE                                0x1
#define _PRG3RTSS_RTSS0_LENGTH                              0x1
#define _PRG3RTSS_RTSS0_MASK                                0x1
#define _PRG3RTSS_RTSS1_POSN                                0x1
#define _PRG3RTSS_RTSS1_POSITION                            0x1
#define _PRG3RTSS_RTSS1_SIZE                                0x1
#define _PRG3RTSS_RTSS1_LENGTH                              0x1
#define _PRG3RTSS_RTSS1_MASK                                0x2
#define _PRG3RTSS_RTSS2_POSN                                0x2
#define _PRG3RTSS_RTSS2_POSITION                            0x2
#define _PRG3RTSS_RTSS2_SIZE                                0x1
#define _PRG3RTSS_RTSS2_LENGTH                              0x1
#define _PRG3RTSS_RTSS2_MASK                                0x4
#define _PRG3RTSS_RTSS3_POSN                                0x3
#define _PRG3RTSS_RTSS3_POSITION                            0x3
#define _PRG3RTSS_RTSS3_SIZE                                0x1
#define _PRG3RTSS_RTSS3_LENGTH                              0x1
#define _PRG3RTSS_RTSS3_MASK                                0x8
#define _PRG3RTSS_RG3RTSS0_POSN                             0x0
#define _PRG3RTSS_RG3RTSS0_POSITION                         0x0
#define _PRG3RTSS_RG3RTSS0_SIZE                             0x1
#define _PRG3RTSS_RG3RTSS0_LENGTH                           0x1
#define _PRG3RTSS_RG3RTSS0_MASK                             0x1
#define _PRG3RTSS_RG3RTSS1_POSN                             0x1
#define _PRG3RTSS_RG3RTSS1_POSITION                         0x1
#define _PRG3RTSS_RG3RTSS1_SIZE                             0x1
#define _PRG3RTSS_RG3RTSS1_LENGTH                           0x1
#define _PRG3RTSS_RG3RTSS1_MASK                             0x2
#define _PRG3RTSS_RG3RTSS2_POSN                             0x2
#define _PRG3RTSS_RG3RTSS2_POSITION                         0x2
#define _PRG3RTSS_RG3RTSS2_SIZE                             0x1
#define _PRG3RTSS_RG3RTSS2_LENGTH                           0x1
#define _PRG3RTSS_RG3RTSS2_MASK                             0x4
#define _PRG3RTSS_RG3RTSS3_POSN                             0x3
#define _PRG3RTSS_RG3RTSS3_POSITION                         0x3
#define _PRG3RTSS_RG3RTSS3_SIZE                             0x1
#define _PRG3RTSS_RG3RTSS3_LENGTH                           0x1
#define _PRG3RTSS_RG3RTSS3_MASK                             0x8

// Register: PRG3FTSS
#define PRG3FTSS PRG3FTSS
extern volatile unsigned char           PRG3FTSS            __at(0x79B);
#ifndef _LIB_BUILD
asm("PRG3FTSS equ 079Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FTSS                   :8;
    };
    struct {
        unsigned FTSS0                  :1;
        unsigned FTSS1                  :1;
        unsigned FTSS2                  :1;
        unsigned FTSS3                  :1;
    };
    struct {
        unsigned RG3FTSS0               :1;
        unsigned RG3FTSS1               :1;
        unsigned RG3FTSS2               :1;
        unsigned RG3FTSS3               :1;
    };
} PRG3FTSSbits_t;
