MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
// Register: COG3BLKR
#define COG3BLKR COG3BLKR
extern volatile unsigned char           COG3BLKR            __at(0x80F);
#ifndef _LIB_BUILD
asm("COG3BLKR equ 080Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKR                   :6;
    };
    struct {
        unsigned BLKR0                  :1;
        unsigned BLKR1                  :1;
        unsigned BLKR2                  :1;
        unsigned BLKR3                  :1;
        unsigned BLKR4                  :1;
        unsigned BLKR5                  :1;
    };
    struct {
        unsigned G3BLKR0                :1;
        unsigned G3BLKR1                :1;
        unsigned G3BLKR2                :1;
        unsigned G3BLKR3                :1;
        unsigned G3BLKR4                :1;
        unsigned G3BLKR5                :1;
    };
} COG3BLKRbits_t;
extern volatile COG3BLKRbits_t COG3BLKRbits __at(0x80F);
// bitfield macros
#define _COG3BLKR_BLKR_POSN                                 0x0
#define _COG3BLKR_BLKR_POSITION                             0x0
#define _COG3BLKR_BLKR_SIZE                                 0x6
#define _COG3BLKR_BLKR_LENGTH                               0x6
#define _COG3BLKR_BLKR_MASK                                 0x3F
#define _COG3BLKR_BLKR0_POSN                                0x0
#define _COG3BLKR_BLKR0_POSITION                            0x0
#define _COG3BLKR_BLKR0_SIZE                                0x1
#define _COG3BLKR_BLKR0_LENGTH                              0x1
#define _COG3BLKR_BLKR0_MASK                                0x1
#define _COG3BLKR_BLKR1_POSN                                0x1
#define _COG3BLKR_BLKR1_POSITION                            0x1
#define _COG3BLKR_BLKR1_SIZE                                0x1
#define _COG3BLKR_BLKR1_LENGTH                              0x1
#define _COG3BLKR_BLKR1_MASK                                0x2
#define _COG3BLKR_BLKR2_POSN                                0x2
#define _COG3BLKR_BLKR2_POSITION                            0x2
#define _COG3BLKR_BLKR2_SIZE                                0x1
#define _COG3BLKR_BLKR2_LENGTH                              0x1
#define _COG3BLKR_BLKR2_MASK                                0x4
#define _COG3BLKR_BLKR3_POSN                                0x3
#define _COG3BLKR_BLKR3_POSITION                            0x3
#define _COG3BLKR_BLKR3_SIZE                                0x1
#define _COG3BLKR_BLKR3_LENGTH                              0x1
#define _COG3BLKR_BLKR3_MASK                                0x8
#define _COG3BLKR_BLKR4_POSN                                0x4
#define _COG3BLKR_BLKR4_POSITION                            0x4
#define _COG3BLKR_BLKR4_SIZE                                0x1
#define _COG3BLKR_BLKR4_LENGTH                              0x1
#define _COG3BLKR_BLKR4_MASK                                0x10
#define _COG3BLKR_BLKR5_POSN                                0x5
#define _COG3BLKR_BLKR5_POSITION                            0x5
#define _COG3BLKR_BLKR5_SIZE                                0x1
#define _COG3BLKR_BLKR5_LENGTH                              0x1
#define _COG3BLKR_BLKR5_MASK                                0x20
#define _COG3BLKR_G3BLKR0_POSN                              0x0
#define _COG3BLKR_G3BLKR0_POSITION                          0x0
#define _COG3BLKR_G3BLKR0_SIZE                              0x1
#define _COG3BLKR_G3BLKR0_LENGTH                            0x1
#define _COG3BLKR_G3BLKR0_MASK                              0x1
#define _COG3BLKR_G3BLKR1_POSN                              0x1
#define _COG3BLKR_G3BLKR1_POSITION                          0x1
#define _COG3BLKR_G3BLKR1_SIZE                              0x1
#define _COG3BLKR_G3BLKR1_LENGTH                            0x1
#define _COG3BLKR_G3BLKR1_MASK                              0x2
#define _COG3BLKR_G3BLKR2_POSN                              0x2
#define _COG3BLKR_G3BLKR2_POSITION                          0x2
#define _COG3BLKR_G3BLKR2_SIZE                              0x1
#define _COG3BLKR_G3BLKR2_LENGTH                            0x1
#define _COG3BLKR_G3BLKR2_MASK                              0x4
#define _COG3BLKR_G3BLKR3_POSN                              0x3
#define _COG3BLKR_G3BLKR3_POSITION                          0x3
#define _COG3BLKR_G3BLKR3_SIZE                              0x1
#define _COG3BLKR_G3BLKR3_LENGTH                            0x1
#define _COG3BLKR_G3BLKR3_MASK                              0x8
#define _COG3BLKR_G3BLKR4_POSN                              0x4
#define _COG3BLKR_G3BLKR4_POSITION                          0x4
#define _COG3BLKR_G3BLKR4_SIZE                              0x1
#define _COG3BLKR_G3BLKR4_LENGTH                            0x1
#define _COG3BLKR_G3BLKR4_MASK                              0x10
#define _COG3BLKR_G3BLKR5_POSN                              0x5
#define _COG3BLKR_G3BLKR5_POSITION                          0x5
#define _COG3BLKR_G3BLKR5_SIZE                              0x1
#define _COG3BLKR_G3BLKR5_LENGTH                            0x1
#define _COG3BLKR_G3BLKR5_MASK                              0x20

// Register: COG3BLKF
#define COG3BLKF COG3BLKF
extern volatile unsigned char           COG3BLKF            __at(0x810);
#ifndef _LIB_BUILD
asm("COG3BLKF equ 0810h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKF                   :6;
    };
    struct {
        unsigned BLKF0                  :1;
        unsigned BLKF1                  :1;
        unsigned BLKF2                  :1;
        unsigned BLKF3                  :1;
        unsigned BLKF4                  :1;
        unsigned BLKF5                  :1;
    };
    struct {
        unsigned G3BLKF0                :1;
        unsigned G3BLKF1                :1;
        unsigned G3BLKF2                :1;
        unsigned G3BLKF3                :1;
        unsigned G3BLKF4                :1;
        unsigned G3BLKF5                :1;
    };
} COG3BLKFbits_t;
extern volatile COG3BLKFbits_t COG3BLKFbits __at(0x810);
// bitfield macros
#define _COG3BLKF_BLKF_POSN                                 0x0
#define _COG3BLKF_BLKF_POSITION                             0x0
#define _COG3BLKF_BLKF_SIZE                                 0x6
#define _COG3BLKF_BLKF_LENGTH                               0x6
#define _COG3BLKF_BLKF_MASK                                 0x3F
#define _COG3BLKF_BLKF0_POSN                                0x0
#define _COG3BLKF_BLKF0_POSITION                            0x0
#define _COG3BLKF_BLKF0_SIZE                                0x1
#define _COG3BLKF_BLKF0_LENGTH                              0x1
#define _COG3BLKF_BLKF0_MASK                                0x1
#define _COG3BLKF_BLKF1_POSN                                0x1
#define _COG3BLKF_BLKF1_POSITION                            0x1
#define _COG3BLKF_BLKF1_SIZE                                0x1
#define _COG3BLKF_BLKF1_LENGTH                              0x1
#define _COG3BLKF_BLKF1_MASK                                0x2
#define _COG3BLKF_BLKF2_POSN                                0x2
#define _COG3BLKF_BLKF2_POSITION                            0x2
#define _COG3BLKF_BLKF2_SIZE                                0x1
#define _COG3BLKF_BLKF2_LENGTH                              0x1
#define _COG3BLKF_BLKF2_MASK                                0x4
#define _COG3BLKF_BLKF3_POSN                                0x3
#define _COG3BLKF_BLKF3_POSITION                            0x3
#define _COG3BLKF_BLKF3_SIZE                                0x1
#define _COG3BLKF_BLKF3_LENGTH                              0x1
#define _COG3BLKF_BLKF3_MASK                                0x8
#define _COG3BLKF_BLKF4_POSN                                0x4
#define _COG3BLKF_BLKF4_POSITION                            0x4
#define _COG3BLKF_BLKF4_SIZE                                0x1
#define _COG3BLKF_BLKF4_LENGTH                              0x1
#define _COG3BLKF_BLKF4_MASK                                0x10
#define _COG3BLKF_BLKF5_POSN                                0x5
#define _COG3BLKF_BLKF5_POSITION                            0x5
#define _COG3BLKF_BLKF5_SIZE                                0x1
#define _COG3BLKF_BLKF5_LENGTH                              0x1
#define _COG3BLKF_BLKF5_MASK                                0x20
#define _COG3BLKF_G3BLKF0_POSN                              0x0
#define _COG3BLKF_G3BLKF0_POSITION                          0x0
#define _COG3BLKF_G3BLKF0_SIZE                              0x1
#define _COG3BLKF_G3BLKF0_LENGTH                            0x1
#define _COG3BLKF_G3BLKF0_MASK                              0x1
#define _COG3BLKF_G3BLKF1_POSN                              0x1
#define _COG3BLKF_G3BLKF1_POSITION                          0x1
#define _COG3BLKF_G3BLKF1_SIZE                              0x1
#define _COG3BLKF_G3BLKF1_LENGTH                            0x1
#define _COG3BLKF_G3BLKF1_MASK                              0x2
#define _COG3BLKF_G3BLKF2_POSN                              0x2
#define _COG3BLKF_G3BLKF2_POSITION                          0x2
#define _COG3BLKF_G3BLKF2_SIZE                              0x1
#define _COG3BLKF_G3BLKF2_LENGTH                            0x1
#define _COG3BLKF_G3BLKF2_MASK                              0x4
#define _COG3BLKF_G3BLKF3_POSN                              0x3
#define _COG3BLKF_G3BLKF3_POSITION                          0x3
#define _COG3BLKF_G3BLKF3_SIZE                              0x1
#define _COG3BLKF_G3BLKF3_LENGTH                            0x1
#define _COG3BLKF_G3BLKF3_MASK                              0x8
#define _COG3BLKF_G3BLKF4_POSN                              0x4
#define _COG3BLKF_G3BLKF4_POSITION                          0x4
#define _COG3BLKF_G3BLKF4_SIZE                              0x1
#define _COG3BLKF_G3BLKF4_LENGTH                            0x1
#define _COG3BLKF_G3BLKF4_MASK                              0x10
#define _COG3BLKF_G3BLKF5_POSN                              0x5
#define _COG3BLKF_G3BLKF5_POSITION                          0x5
#define _COG3BLKF_G3BLKF5_SIZE                              0x1
#define _COG3BLKF_G3BLKF5_LENGTH                            0x1
#define _COG3BLKF_G3BLKF5_MASK                              0x20

// Register: COG3DBR
#define COG3DBR COG3DBR
extern volatile unsigned char           COG3DBR             __at(0x811);
#ifndef _LIB_BUILD
asm("COG3DBR equ 0811h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned G3DBR0                 :1;
        unsigned G3DBR1                 :1;
        unsigned G3DBR2                 :1;
        unsigned G3DBR3                 :1;
        unsigned G3DBR4                 :1;
        unsigned G3DBR5                 :1;
    };
} COG3DBRbits_t;
