MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
extern volatile PWM5INTFLGbits_t PWM5INTFLGbits __at(0xD9D);
// bitfield macros
#define _PWM5INTFLG_PRIF_POSN                               0x0
#define _PWM5INTFLG_PRIF_POSITION                           0x0
#define _PWM5INTFLG_PRIF_SIZE                               0x1
#define _PWM5INTFLG_PRIF_LENGTH                             0x1
#define _PWM5INTFLG_PRIF_MASK                               0x1
#define _PWM5INTFLG_DCIF_POSN                               0x1
#define _PWM5INTFLG_DCIF_POSITION                           0x1
#define _PWM5INTFLG_DCIF_SIZE                               0x1
#define _PWM5INTFLG_DCIF_LENGTH                             0x1
#define _PWM5INTFLG_DCIF_MASK                               0x2
#define _PWM5INTFLG_PHIF_POSN                               0x2
#define _PWM5INTFLG_PHIF_POSITION                           0x2
#define _PWM5INTFLG_PHIF_SIZE                               0x1
#define _PWM5INTFLG_PHIF_LENGTH                             0x1
#define _PWM5INTFLG_PHIF_MASK                               0x4
#define _PWM5INTFLG_OFIF_POSN                               0x3
#define _PWM5INTFLG_OFIF_POSITION                           0x3
#define _PWM5INTFLG_OFIF_SIZE                               0x1
#define _PWM5INTFLG_OFIF_LENGTH                             0x1
#define _PWM5INTFLG_OFIF_MASK                               0x8
#define _PWM5INTFLG_PWM5PRIF_POSN                           0x0
#define _PWM5INTFLG_PWM5PRIF_POSITION                       0x0
#define _PWM5INTFLG_PWM5PRIF_SIZE                           0x1
#define _PWM5INTFLG_PWM5PRIF_LENGTH                         0x1
#define _PWM5INTFLG_PWM5PRIF_MASK                           0x1
#define _PWM5INTFLG_PWM5DCIF_POSN                           0x1
#define _PWM5INTFLG_PWM5DCIF_POSITION                       0x1
#define _PWM5INTFLG_PWM5DCIF_SIZE                           0x1
#define _PWM5INTFLG_PWM5DCIF_LENGTH                         0x1
#define _PWM5INTFLG_PWM5DCIF_MASK                           0x2
#define _PWM5INTFLG_PWM5PHIF_POSN                           0x2
#define _PWM5INTFLG_PWM5PHIF_POSITION                       0x2
#define _PWM5INTFLG_PWM5PHIF_SIZE                           0x1
#define _PWM5INTFLG_PWM5PHIF_LENGTH                         0x1
#define _PWM5INTFLG_PWM5PHIF_MASK                           0x4
#define _PWM5INTFLG_PWM5OFIF_POSN                           0x3
#define _PWM5INTFLG_PWM5OFIF_POSITION                       0x3
#define _PWM5INTFLG_PWM5OFIF_SIZE                           0x1
#define _PWM5INTFLG_PWM5OFIF_LENGTH                         0x1
#define _PWM5INTFLG_PWM5OFIF_MASK                           0x8

// Register: PWM5CLKCON
#define PWM5CLKCON PWM5CLKCON
extern volatile unsigned char           PWM5CLKCON          __at(0xD9E);
#ifndef _LIB_BUILD
asm("PWM5CLKCON equ 0D9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM5CS0                :1;
        unsigned PWM5CS1                :1;
        unsigned PWM5CS2                :1;
        unsigned                        :1;
        unsigned PWM5PS0                :1;
        unsigned PWM5PS1                :1;
        unsigned PWM5PS2                :1;
    };
    struct {
        unsigned PWM5CS                 :3;
        unsigned                        :1;
        unsigned PWM5PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned                        :1;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM5CLKCONbits_t;
extern volatile PWM5CLKCONbits_t PWM5CLKCONbits __at(0xD9E);
// bitfield macros
#define _PWM5CLKCON_CS_POSN                                 0x0
#define _PWM5CLKCON_CS_POSITION                             0x0
#define _PWM5CLKCON_CS_SIZE                                 0x2
#define _PWM5CLKCON_CS_LENGTH                               0x2
#define _PWM5CLKCON_CS_MASK                                 0x3
#define _PWM5CLKCON_PS_POSN                                 0x4
#define _PWM5CLKCON_PS_POSITION                             0x4
#define _PWM5CLKCON_PS_SIZE                                 0x3
#define _PWM5CLKCON_PS_LENGTH                               0x3
#define _PWM5CLKCON_PS_MASK                                 0x70
#define _PWM5CLKCON_PWM5CS0_POSN                            0x0
#define _PWM5CLKCON_PWM5CS0_POSITION                        0x0
#define _PWM5CLKCON_PWM5CS0_SIZE                            0x1
#define _PWM5CLKCON_PWM5CS0_LENGTH                          0x1
#define _PWM5CLKCON_PWM5CS0_MASK                            0x1
#define _PWM5CLKCON_PWM5CS1_POSN                            0x1
#define _PWM5CLKCON_PWM5CS1_POSITION                        0x1
#define _PWM5CLKCON_PWM5CS1_SIZE                            0x1
#define _PWM5CLKCON_PWM5CS1_LENGTH                          0x1
#define _PWM5CLKCON_PWM5CS1_MASK                            0x2
#define _PWM5CLKCON_PWM5CS2_POSN                            0x2
#define _PWM5CLKCON_PWM5CS2_POSITION                        0x2
#define _PWM5CLKCON_PWM5CS2_SIZE                            0x1
#define _PWM5CLKCON_PWM5CS2_LENGTH                          0x1
#define _PWM5CLKCON_PWM5CS2_MASK                            0x4
#define _PWM5CLKCON_PWM5PS0_POSN                            0x4
#define _PWM5CLKCON_PWM5PS0_POSITION                        0x4
#define _PWM5CLKCON_PWM5PS0_SIZE                            0x1
#define _PWM5CLKCON_PWM5PS0_LENGTH                          0x1
#define _PWM5CLKCON_PWM5PS0_MASK                            0x10
#define _PWM5CLKCON_PWM5PS1_POSN                            0x5
#define _PWM5CLKCON_PWM5PS1_POSITION                        0x5
#define _PWM5CLKCON_PWM5PS1_SIZE                            0x1
#define _PWM5CLKCON_PWM5PS1_LENGTH                          0x1
#define _PWM5CLKCON_PWM5PS1_MASK                            0x20
#define _PWM5CLKCON_PWM5PS2_POSN                            0x6
#define _PWM5CLKCON_PWM5PS2_POSITION                        0x6
#define _PWM5CLKCON_PWM5PS2_SIZE                            0x1
#define _PWM5CLKCON_PWM5PS2_LENGTH                          0x1
#define _PWM5CLKCON_PWM5PS2_MASK                            0x40
#define _PWM5CLKCON_PWM5CS_POSN                             0x0
#define _PWM5CLKCON_PWM5CS_POSITION                         0x0
#define _PWM5CLKCON_PWM5CS_SIZE                             0x3
#define _PWM5CLKCON_PWM5CS_LENGTH                           0x3
#define _PWM5CLKCON_PWM5CS_MASK                             0x7
#define _PWM5CLKCON_PWM5PS_POSN                             0x4
#define _PWM5CLKCON_PWM5PS_POSITION                         0x4
#define _PWM5CLKCON_PWM5PS_SIZE                             0x3
#define _PWM5CLKCON_PWM5PS_LENGTH                           0x3
#define _PWM5CLKCON_PWM5PS_MASK                             0x70
#define _PWM5CLKCON_CS0_POSN                                0x0
#define _PWM5CLKCON_CS0_POSITION                            0x0
#define _PWM5CLKCON_CS0_SIZE                                0x1
#define _PWM5CLKCON_CS0_LENGTH                              0x1
#define _PWM5CLKCON_CS0_MASK                                0x1
#define _PWM5CLKCON_CS1_POSN                                0x1
#define _PWM5CLKCON_CS1_POSITION                            0x1
#define _PWM5CLKCON_CS1_SIZE                                0x1
#define _PWM5CLKCON_CS1_LENGTH                              0x1
#define _PWM5CLKCON_CS1_MASK                                0x2
#define _PWM5CLKCON_CS2_POSN                                0x2
#define _PWM5CLKCON_CS2_POSITION                            0x2
#define _PWM5CLKCON_CS2_SIZE                                0x1
#define _PWM5CLKCON_CS2_LENGTH                              0x1
#define _PWM5CLKCON_CS2_MASK                                0x4
#define _PWM5CLKCON_PS0_POSN                                0x4
#define _PWM5CLKCON_PS0_POSITION                            0x4
#define _PWM5CLKCON_PS0_SIZE                                0x1
#define _PWM5CLKCON_PS0_LENGTH                              0x1
#define _PWM5CLKCON_PS0_MASK                                0x10
#define _PWM5CLKCON_PS1_POSN                                0x5
#define _PWM5CLKCON_PS1_POSITION                            0x5
#define _PWM5CLKCON_PS1_SIZE                                0x1
#define _PWM5CLKCON_PS1_LENGTH                              0x1
#define _PWM5CLKCON_PS1_MASK                                0x20
#define _PWM5CLKCON_PS2_POSN                                0x6
#define _PWM5CLKCON_PS2_POSITION                            0x6
#define _PWM5CLKCON_PS2_SIZE                                0x1
#define _PWM5CLKCON_PS2_LENGTH                              0x1
#define _PWM5CLKCON_PS2_MASK                                0x40

// Register: PWM5LDCON
#define PWM5LDCON PWM5LDCON
extern volatile unsigned char           PWM5LDCON           __at(0xD9F);
#ifndef _LIB_BUILD
asm("PWM5LDCON equ 0D9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM5LDS0               :1;
        unsigned PWM5LDS1               :1;
    };
    struct {
        unsigned PWM5LDS                :2;
        unsigned                        :4;
        unsigned PWM5LDM                :1;
        unsigned PWM5LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM5LDCONbits_t;
extern volatile PWM5LDCONbits_t PWM5LDCONbits __at(0xD9F);
// bitfield macros
#define _PWM5LDCON_LDS_POSN                                 0x0
#define _PWM5LDCON_LDS_POSITION                             0x0
#define _PWM5LDCON_LDS_SIZE                                 0x2
#define _PWM5LDCON_LDS_LENGTH                               0x2
#define _PWM5LDCON_LDS_MASK                                 0x3
#define _PWM5LDCON_LDT_POSN                                 0x6
#define _PWM5LDCON_LDT_POSITION                             0x6
#define _PWM5LDCON_LDT_SIZE                                 0x1
#define _PWM5LDCON_LDT_LENGTH                               0x1
#define _PWM5LDCON_LDT_MASK                                 0x40
#define _PWM5LDCON_LDA_POSN                                 0x7
#define _PWM5LDCON_LDA_POSITION                             0x7
#define _PWM5LDCON_LDA_SIZE                                 0x1
#define _PWM5LDCON_LDA_LENGTH                               0x1
#define _PWM5LDCON_LDA_MASK                                 0x80
#define _PWM5LDCON_PWM5LDS0_POSN                            0x0
#define _PWM5LDCON_PWM5LDS0_POSITION                        0x0
#define _PWM5LDCON_PWM5LDS0_SIZE                            0x1
#define _PWM5LDCON_PWM5LDS0_LENGTH                          0x1
#define _PWM5LDCON_PWM5LDS0_MASK                            0x1
#define _PWM5LDCON_PWM5LDS1_POSN                            0x1
#define _PWM5LDCON_PWM5LDS1_POSITION                        0x1
#define _PWM5LDCON_PWM5LDS1_SIZE                            0x1
#define _PWM5LDCON_PWM5LDS1_LENGTH                          0x1
#define _PWM5LDCON_PWM5LDS1_MASK                            0x2
#define _PWM5LDCON_PWM5LDS_POSN                             0x0
#define _PWM5LDCON_PWM5LDS_POSITION                         0x0
#define _PWM5LDCON_PWM5LDS_SIZE                             0x2
#define _PWM5LDCON_PWM5LDS_LENGTH                           0x2
#define _PWM5LDCON_PWM5LDS_MASK                             0x3
#define _PWM5LDCON_PWM5LDM_POSN                             0x6
#define _PWM5LDCON_PWM5LDM_POSITION                         0x6
#define _PWM5LDCON_PWM5LDM_SIZE                             0x1
#define _PWM5LDCON_PWM5LDM_LENGTH                           0x1
#define _PWM5LDCON_PWM5LDM_MASK                             0x40
#define _PWM5LDCON_PWM5LD_POSN                              0x7
#define _PWM5LDCON_PWM5LD_POSITION                          0x7
#define _PWM5LDCON_PWM5LD_SIZE                              0x1
#define _PWM5LDCON_PWM5LD_LENGTH                            0x1
#define _PWM5LDCON_PWM5LD_MASK                              0x80
#define _PWM5LDCON_LDS0_POSN                                0x0
#define _PWM5LDCON_LDS0_POSITION                            0x0
#define _PWM5LDCON_LDS0_SIZE                                0x1
#define _PWM5LDCON_LDS0_LENGTH                              0x1
#define _PWM5LDCON_LDS0_MASK                                0x1
#define _PWM5LDCON_LDS1_POSN                                0x1
#define _PWM5LDCON_LDS1_POSITION                            0x1
#define _PWM5LDCON_LDS1_SIZE                                0x1
#define _PWM5LDCON_LDS1_LENGTH                              0x1
#define _PWM5LDCON_LDS1_MASK                                0x2

