MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
// Register: PWM6PHH
#define PWM6PHH PWM6PHH
extern volatile unsigned char           PWM6PHH             __at(0xDA2);
#ifndef _LIB_BUILD
asm("PWM6PHH equ 0DA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM6PHH0               :1;
        unsigned PWM6PHH1               :1;
        unsigned PWM6PHH2               :1;
        unsigned PWM6PHH3               :1;
        unsigned PWM6PHH4               :1;
        unsigned PWM6PHH5               :1;
        unsigned PWM6PHH6               :1;
        unsigned PWM6PHH7               :1;
    };
    struct {
        unsigned PWM6PHH                :8;
    };
} PWM6PHHbits_t;
extern volatile PWM6PHHbits_t PWM6PHHbits __at(0xDA2);
// bitfield macros
#define _PWM6PHH_PH_POSN                                    0x0
#define _PWM6PHH_PH_POSITION                                0x0
#define _PWM6PHH_PH_SIZE                                    0x8
#define _PWM6PHH_PH_LENGTH                                  0x8
#define _PWM6PHH_PH_MASK                                    0xFF
#define _PWM6PHH_PWM6PHH0_POSN                              0x0
#define _PWM6PHH_PWM6PHH0_POSITION                          0x0
#define _PWM6PHH_PWM6PHH0_SIZE                              0x1
#define _PWM6PHH_PWM6PHH0_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH0_MASK                              0x1
#define _PWM6PHH_PWM6PHH1_POSN                              0x1
#define _PWM6PHH_PWM6PHH1_POSITION                          0x1
#define _PWM6PHH_PWM6PHH1_SIZE                              0x1
#define _PWM6PHH_PWM6PHH1_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH1_MASK                              0x2
#define _PWM6PHH_PWM6PHH2_POSN                              0x2
#define _PWM6PHH_PWM6PHH2_POSITION                          0x2
#define _PWM6PHH_PWM6PHH2_SIZE                              0x1
#define _PWM6PHH_PWM6PHH2_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH2_MASK                              0x4
#define _PWM6PHH_PWM6PHH3_POSN                              0x3
#define _PWM6PHH_PWM6PHH3_POSITION                          0x3
#define _PWM6PHH_PWM6PHH3_SIZE                              0x1
#define _PWM6PHH_PWM6PHH3_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH3_MASK                              0x8
#define _PWM6PHH_PWM6PHH4_POSN                              0x4
#define _PWM6PHH_PWM6PHH4_POSITION                          0x4
#define _PWM6PHH_PWM6PHH4_SIZE                              0x1
#define _PWM6PHH_PWM6PHH4_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH4_MASK                              0x10
#define _PWM6PHH_PWM6PHH5_POSN                              0x5
#define _PWM6PHH_PWM6PHH5_POSITION                          0x5
#define _PWM6PHH_PWM6PHH5_SIZE                              0x1
#define _PWM6PHH_PWM6PHH5_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH5_MASK                              0x20
#define _PWM6PHH_PWM6PHH6_POSN                              0x6
#define _PWM6PHH_PWM6PHH6_POSITION                          0x6
#define _PWM6PHH_PWM6PHH6_SIZE                              0x1
#define _PWM6PHH_PWM6PHH6_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH6_MASK                              0x40
#define _PWM6PHH_PWM6PHH7_POSN                              0x7
#define _PWM6PHH_PWM6PHH7_POSITION                          0x7
#define _PWM6PHH_PWM6PHH7_SIZE                              0x1
#define _PWM6PHH_PWM6PHH7_LENGTH                            0x1
#define _PWM6PHH_PWM6PHH7_MASK                              0x80
#define _PWM6PHH_PWM6PHH_POSN                               0x0
#define _PWM6PHH_PWM6PHH_POSITION                           0x0
#define _PWM6PHH_PWM6PHH_SIZE                               0x8
#define _PWM6PHH_PWM6PHH_LENGTH                             0x8
#define _PWM6PHH_PWM6PHH_MASK                               0xFF

// Register: PWM6DC
#define PWM6DC PWM6DC
extern volatile unsigned short          PWM6DC              __at(0xDA3);
#ifndef _LIB_BUILD
asm("PWM6DC equ 0DA3h");
#endif

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0xDA3);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 0DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM6DCL0               :1;
        unsigned PWM6DCL1               :1;
        unsigned PWM6DCL2               :1;
        unsigned PWM6DCL3               :1;
        unsigned PWM6DCL4               :1;
        unsigned PWM6DCL5               :1;
        unsigned PWM6DCL6               :1;
        unsigned PWM6DCL7               :1;
    };
    struct {
        unsigned PWM6DCL                :8;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0xDA3);
// bitfield macros
#define _PWM6DCL_DC_POSN                                    0x0
#define _PWM6DCL_DC_POSITION                                0x0
#define _PWM6DCL_DC_SIZE                                    0x8
#define _PWM6DCL_DC_LENGTH                                  0x8
#define _PWM6DCL_DC_MASK                                    0xFF
#define _PWM6DCL_PWM6DCL0_POSN                              0x0
#define _PWM6DCL_PWM6DCL0_POSITION                          0x0
#define _PWM6DCL_PWM6DCL0_SIZE                              0x1
#define _PWM6DCL_PWM6DCL0_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL0_MASK                              0x1
#define _PWM6DCL_PWM6DCL1_POSN                              0x1
#define _PWM6DCL_PWM6DCL1_POSITION                          0x1
#define _PWM6DCL_PWM6DCL1_SIZE                              0x1
#define _PWM6DCL_PWM6DCL1_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL1_MASK                              0x2
#define _PWM6DCL_PWM6DCL2_POSN                              0x2
#define _PWM6DCL_PWM6DCL2_POSITION                          0x2
#define _PWM6DCL_PWM6DCL2_SIZE                              0x1
#define _PWM6DCL_PWM6DCL2_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL2_MASK                              0x4
#define _PWM6DCL_PWM6DCL3_POSN                              0x3
#define _PWM6DCL_PWM6DCL3_POSITION                          0x3
#define _PWM6DCL_PWM6DCL3_SIZE                              0x1
#define _PWM6DCL_PWM6DCL3_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL3_MASK                              0x8
#define _PWM6DCL_PWM6DCL4_POSN                              0x4
#define _PWM6DCL_PWM6DCL4_POSITION                          0x4
#define _PWM6DCL_PWM6DCL4_SIZE                              0x1
#define _PWM6DCL_PWM6DCL4_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL4_MASK                              0x10
#define _PWM6DCL_PWM6DCL5_POSN                              0x5
#define _PWM6DCL_PWM6DCL5_POSITION                          0x5
#define _PWM6DCL_PWM6DCL5_SIZE                              0x1
#define _PWM6DCL_PWM6DCL5_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL5_MASK                              0x20
#define _PWM6DCL_PWM6DCL6_POSN                              0x6
#define _PWM6DCL_PWM6DCL6_POSITION                          0x6
#define _PWM6DCL_PWM6DCL6_SIZE                              0x1
#define _PWM6DCL_PWM6DCL6_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL6_MASK                              0x40
#define _PWM6DCL_PWM6DCL7_POSN                              0x7
#define _PWM6DCL_PWM6DCL7_POSITION                          0x7
#define _PWM6DCL_PWM6DCL7_SIZE                              0x1
#define _PWM6DCL_PWM6DCL7_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL7_MASK                              0x80
#define _PWM6DCL_PWM6DCL_POSN                               0x0
#define _PWM6DCL_PWM6DCL_POSITION                           0x0
#define _PWM6DCL_PWM6DCL_SIZE                               0x8
#define _PWM6DCL_PWM6DCL_LENGTH                             0x8
#define _PWM6DCL_PWM6DCL_MASK                               0xFF

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0xDA4);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 0DA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM6DCH0               :1;
        unsigned PWM6DCH1               :1;
        unsigned PWM6DCH2               :1;
        unsigned PWM6DCH3               :1;
        unsigned PWM6DCH4               :1;
        unsigned PWM6DCH5               :1;
        unsigned PWM6DCH6               :1;
        unsigned PWM6DCH7               :1;
    };
    struct {
        unsigned PWM6DCH                :8;
    };
} PWM6DCHbits_t;
extern volatile PWM6DCHbits_t PWM6DCHbits __at(0xDA4);
// bitfield macros
#define _PWM6DCH_DC_POSN                                    0x0
#define _PWM6DCH_DC_POSITION                                0x0
#define _PWM6DCH_DC_SIZE                                    0x8
#define _PWM6DCH_DC_LENGTH                                  0x8
#define _PWM6DCH_DC_MASK                                    0xFF
#define _PWM6DCH_PWM6DCH0_POSN                              0x0
#define _PWM6DCH_PWM6DCH0_POSITION                          0x0
#define _PWM6DCH_PWM6DCH0_SIZE                              0x1
#define _PWM6DCH_PWM6DCH0_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH0_MASK                              0x1
#define _PWM6DCH_PWM6DCH1_POSN                              0x1
#define _PWM6DCH_PWM6DCH1_POSITION                          0x1
#define _PWM6DCH_PWM6DCH1_SIZE                              0x1
#define _PWM6DCH_PWM6DCH1_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH1_MASK                              0x2
#define _PWM6DCH_PWM6DCH2_POSN                              0x2
#define _PWM6DCH_PWM6DCH2_POSITION                          0x2
#define _PWM6DCH_PWM6DCH2_SIZE                              0x1
#define _PWM6DCH_PWM6DCH2_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH2_MASK                              0x4
#define _PWM6DCH_PWM6DCH3_POSN                              0x3
#define _PWM6DCH_PWM6DCH3_POSITION                          0x3
#define _PWM6DCH_PWM6DCH3_SIZE                              0x1
#define _PWM6DCH_PWM6DCH3_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH3_MASK                              0x8
#define _PWM6DCH_PWM6DCH4_POSN                              0x4
#define _PWM6DCH_PWM6DCH4_POSITION                          0x4
#define _PWM6DCH_PWM6DCH4_SIZE                              0x1
#define _PWM6DCH_PWM6DCH4_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH4_MASK                              0x10
#define _PWM6DCH_PWM6DCH5_POSN                              0x5
#define _PWM6DCH_PWM6DCH5_POSITION                          0x5
#define _PWM6DCH_PWM6DCH5_SIZE                              0x1
#define _PWM6DCH_PWM6DCH5_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH5_MASK                              0x20
#define _PWM6DCH_PWM6DCH6_POSN                              0x6
#define _PWM6DCH_PWM6DCH6_POSITION                          0x6
#define _PWM6DCH_PWM6DCH6_SIZE                              0x1
#define _PWM6DCH_PWM6DCH6_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH6_MASK                              0x40
#define _PWM6DCH_PWM6DCH7_POSN                              0x7
#define _PWM6DCH_PWM6DCH7_POSITION                          0x7
#define _PWM6DCH_PWM6DCH7_SIZE                              0x1
#define _PWM6DCH_PWM6DCH7_LENGTH                            0x1
#define _PWM6DCH_PWM6DCH7_MASK                              0x80
#define _PWM6DCH_PWM6DCH_POSN                               0x0
#define _PWM6DCH_PWM6DCH_POSITION                           0x0
#define _PWM6DCH_PWM6DCH_SIZE                               0x8
#define _PWM6DCH_PWM6DCH_LENGTH                             0x8
#define _PWM6DCH_PWM6DCH_MASK                               0xFF

// Register: PWM6PR
#define PWM6PR PWM6PR
extern volatile unsigned short          PWM6PR              __at(0xDA5);
#ifndef _LIB_BUILD
asm("PWM6PR equ 0DA5h");
#endif

// Register: PWM6PRL
#define PWM6PRL PWM6PRL
extern volatile unsigned char           PWM6PRL             __at(0xDA5);
#ifndef _LIB_BUILD
asm("PWM6PRL equ 0DA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM6PRL0               :1;
        unsigned PWM6PRL1               :1;
        unsigned PWM6PRL2               :1;
        unsigned PWM6PRL3               :1;
        unsigned PWM6PRL4               :1;
        unsigned PWM6PRL5               :1;
        unsigned PWM6PRL6               :1;
        unsigned PWM6PRL7               :1;
    };
    struct {
        unsigned PWM6PRL                :8;
    };
} PWM6PRLbits_t;
extern volatile PWM6PRLbits_t PWM6PRLbits __at(0xDA5);
// bitfield macros
#define _PWM6PRL_PR_POSN                                    0x0
#define _PWM6PRL_PR_POSITION                                0x0
#define _PWM6PRL_PR_SIZE                                    0x8
#define _PWM6PRL_PR_LENGTH                                  0x8
#define _PWM6PRL_PR_MASK                                    0xFF
#define _PWM6PRL_PWM6PRL0_POSN                              0x0
#define _PWM6PRL_PWM6PRL0_POSITION                          0x0
#define _PWM6PRL_PWM6PRL0_SIZE                              0x1
#define _PWM6PRL_PWM6PRL0_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL0_MASK                              0x1
#define _PWM6PRL_PWM6PRL1_POSN                              0x1
#define _PWM6PRL_PWM6PRL1_POSITION                          0x1
#define _PWM6PRL_PWM6PRL1_SIZE                              0x1
#define _PWM6PRL_PWM6PRL1_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL1_MASK                              0x2
#define _PWM6PRL_PWM6PRL2_POSN                              0x2
#define _PWM6PRL_PWM6PRL2_POSITION                          0x2
#define _PWM6PRL_PWM6PRL2_SIZE                              0x1
#define _PWM6PRL_PWM6PRL2_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL2_MASK                              0x4
#define _PWM6PRL_PWM6PRL3_POSN                              0x3
#define _PWM6PRL_PWM6PRL3_POSITION                          0x3
#define _PWM6PRL_PWM6PRL3_SIZE                              0x1
#define _PWM6PRL_PWM6PRL3_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL3_MASK                              0x8
#define _PWM6PRL_PWM6PRL4_POSN                              0x4
#define _PWM6PRL_PWM6PRL4_POSITION                          0x4
#define _PWM6PRL_PWM6PRL4_SIZE                              0x1
#define _PWM6PRL_PWM6PRL4_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL4_MASK                              0x10
#define _PWM6PRL_PWM6PRL5_POSN                              0x5
#define _PWM6PRL_PWM6PRL5_POSITION                          0x5
#define _PWM6PRL_PWM6PRL5_SIZE                              0x1
#define _PWM6PRL_PWM6PRL5_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL5_MASK                              0x20
#define _PWM6PRL_PWM6PRL6_POSN                              0x6
#define _PWM6PRL_PWM6PRL6_POSITION                          0x6
#define _PWM6PRL_PWM6PRL6_SIZE                              0x1
#define _PWM6PRL_PWM6PRL6_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL6_MASK                              0x40
#define _PWM6PRL_PWM6PRL7_POSN                              0x7
#define _PWM6PRL_PWM6PRL7_POSITION                          0x7
#define _PWM6PRL_PWM6PRL7_SIZE                              0x1
#define _PWM6PRL_PWM6PRL7_LENGTH                            0x1
#define _PWM6PRL_PWM6PRL7_MASK                              0x80
#define _PWM6PRL_PWM6PRL_POSN                               0x0
#define _PWM6PRL_PWM6PRL_POSITION                           0x0
#define _PWM6PRL_PWM6PRL_SIZE                               0x8
#define _PWM6PRL_PWM6PRL_LENGTH                             0x8
#define _PWM6PRL_PWM6PRL_MASK                               0xFF

// Register: PWM6PRH
#define PWM6PRH PWM6PRH
extern volatile unsigned char           PWM6PRH             __at(0xDA6);
#ifndef _LIB_BUILD
asm("PWM6PRH equ 0DA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM6PRH0               :1;
        unsigned PWM6PRH1               :1;
        unsigned PWM6PRH2               :1;
        unsigned PWM6PRH3               :1;
        unsigned PWM6PRH4               :1;
        unsigned PWM6PRH5               :1;
        unsigned PWM6PRH6               :1;
        unsigned PWM6PRH7               :1;
    };
    struct {
        unsigned PWM6PRH                :8;
    };
} PWM6PRHbits_t;
extern volatile PWM6PRHbits_t PWM6PRHbits __at(0xDA6);
// bitfield macros
#define _PWM6PRH_PR_POSN                                    0x0
#define _PWM6PRH_PR_POSITION                                0x0
#define _PWM6PRH_PR_SIZE                                    0x8
#define _PWM6PRH_PR_LENGTH                                  0x8
#define _PWM6PRH_PR_MASK                                    0xFF
#define _PWM6PRH_PWM6PRH0_POSN                              0x0
#define _PWM6PRH_PWM6PRH0_POSITION                          0x0
#define _PWM6PRH_PWM6PRH0_SIZE                              0x1
#define _PWM6PRH_PWM6PRH0_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH0_MASK                              0x1
#define _PWM6PRH_PWM6PRH1_POSN                              0x1
#define _PWM6PRH_PWM6PRH1_POSITION                          0x1
#define _PWM6PRH_PWM6PRH1_SIZE                              0x1
#define _PWM6PRH_PWM6PRH1_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH1_MASK                              0x2
#define _PWM6PRH_PWM6PRH2_POSN                              0x2
#define _PWM6PRH_PWM6PRH2_POSITION                          0x2
#define _PWM6PRH_PWM6PRH2_SIZE                              0x1
#define _PWM6PRH_PWM6PRH2_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH2_MASK                              0x4
#define _PWM6PRH_PWM6PRH3_POSN                              0x3
#define _PWM6PRH_PWM6PRH3_POSITION                          0x3
#define _PWM6PRH_PWM6PRH3_SIZE                              0x1
#define _PWM6PRH_PWM6PRH3_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH3_MASK                              0x8
#define _PWM6PRH_PWM6PRH4_POSN                              0x4
#define _PWM6PRH_PWM6PRH4_POSITION                          0x4
#define _PWM6PRH_PWM6PRH4_SIZE                              0x1
#define _PWM6PRH_PWM6PRH4_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH4_MASK                              0x10
#define _PWM6PRH_PWM6PRH5_POSN                              0x5
#define _PWM6PRH_PWM6PRH5_POSITION                          0x5
#define _PWM6PRH_PWM6PRH5_SIZE                              0x1
#define _PWM6PRH_PWM6PRH5_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH5_MASK                              0x20
#define _PWM6PRH_PWM6PRH6_POSN                              0x6
#define _PWM6PRH_PWM6PRH6_POSITION                          0x6
#define _PWM6PRH_PWM6PRH6_SIZE                              0x1
#define _PWM6PRH_PWM6PRH6_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH6_MASK                              0x40
#define _PWM6PRH_PWM6PRH7_POSN                              0x7
#define _PWM6PRH_PWM6PRH7_POSITION                          0x7
#define _PWM6PRH_PWM6PRH7_SIZE                              0x1
#define _PWM6PRH_PWM6PRH7_LENGTH                            0x1
#define _PWM6PRH_PWM6PRH7_MASK                              0x80
#define _PWM6PRH_PWM6PRH_POSN                               0x0
#define _PWM6PRH_PWM6PRH_POSITION                           0x0
#define _PWM6PRH_PWM6PRH_SIZE                               0x8
#define _PWM6PRH_PWM6PRH_LENGTH                             0x8
#define _PWM6PRH_PWM6PRH_MASK                               0xFF

// Register: PWM6OF
#define PWM6OF PWM6OF
extern volatile unsigned short          PWM6OF              __at(0xDA7);
#ifndef _LIB_BUILD
asm("PWM6OF equ 0DA7h");
#endif

// Register: PWM6OFL
#define PWM6OFL PWM6OFL
extern volatile unsigned char           PWM6OFL             __at(0xDA7);
#ifndef _LIB_BUILD
asm("PWM6OFL equ 0DA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM6OFL0               :1;
        unsigned PWM6OFL1               :1;
        unsigned PWM6OFL2               :1;
        unsigned PWM6OFL3               :1;
        unsigned PWM6OFL4               :1;
        unsigned PWM6OFL5               :1;
        unsigned PWM6OFL6               :1;
        unsigned PWM6OFL7               :1;
    };
    struct {
        unsigned PWM6OFL                :8;
    };
} PWM6OFLbits_t;
