MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1776/mcu.h
// CLC4GLS0<LC4G1D4T>
extern volatile __bit                   LC4G1D4T            __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 LC4G1D4T_bit        _BIT_ACCESS(CLC4GLS0,7)
// CLC4POL<LC4G1POL>
extern volatile __bit                   LC4G1POL            __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 LC4G1POL_bit        _BIT_ACCESS(CLC4POL,0)
// CLC4GLS1<LC4G2D1N>
extern volatile __bit                   LC4G2D1N            __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 LC4G2D1N_bit        _BIT_ACCESS(CLC4GLS1,0)
// CLC4GLS1<LC4G2D1T>
extern volatile __bit                   LC4G2D1T            __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 LC4G2D1T_bit        _BIT_ACCESS(CLC4GLS1,1)
// CLC4GLS1<LC4G2D2N>
extern volatile __bit                   LC4G2D2N            __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 LC4G2D2N_bit        _BIT_ACCESS(CLC4GLS1,2)
// CLC4GLS1<LC4G2D2T>
extern volatile __bit                   LC4G2D2T            __at(0x79AB);	// @ (0xF35 * 8 + 3)
#define                                 LC4G2D2T_bit        _BIT_ACCESS(CLC4GLS1,3)
// CLC4GLS1<LC4G2D3N>
extern volatile __bit                   LC4G2D3N            __at(0x79AC);	// @ (0xF35 * 8 + 4)
#define                                 LC4G2D3N_bit        _BIT_ACCESS(CLC4GLS1,4)
// CLC4GLS1<LC4G2D3T>
extern volatile __bit                   LC4G2D3T            __at(0x79AD);	// @ (0xF35 * 8 + 5)
#define                                 LC4G2D3T_bit        _BIT_ACCESS(CLC4GLS1,5)
// CLC4GLS1<LC4G2D4N>
extern volatile __bit                   LC4G2D4N            __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 LC4G2D4N_bit        _BIT_ACCESS(CLC4GLS1,6)
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0x79AF);	// @ (0xF35 * 8 + 7)
#define                                 LC4G2D4T_bit        _BIT_ACCESS(CLC4GLS1,7)
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 LC4G2POL_bit        _BIT_ACCESS(CLC4POL,1)
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 LC4G3D1N_bit        _BIT_ACCESS(CLC4GLS2,0)
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 LC4G3D1T_bit        _BIT_ACCESS(CLC4GLS2,1)
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 LC4G3D2N_bit        _BIT_ACCESS(CLC4GLS2,2)
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 LC4G3D2T_bit        _BIT_ACCESS(CLC4GLS2,3)
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 LC4G3D3N_bit        _BIT_ACCESS(CLC4GLS2,4)
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 LC4G3D3T_bit        _BIT_ACCESS(CLC4GLS2,5)
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 LC4G3D4N_bit        _BIT_ACCESS(CLC4GLS2,6)
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 LC4G3D4T_bit        _BIT_ACCESS(CLC4GLS2,7)
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x79BC);	// @ (0xF37 * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CMOUT<MC3OUT>
extern volatile __bit                   MC3OUT              __at(0x88A);	// @ (0x111 * 8 + 2)
#define                                 MC3OUT_bit          _BIT_ACCESS(CMOUT,2)
// CMOUT<MC4OUT>
extern volatile __bit                   MC4OUT              __at(0x88B);	// @ (0x111 * 8 + 3)
#define                                 MC4OUT_bit          _BIT_ACCESS(CMOUT,3)
// CMOUT<MC5OUT>
extern volatile __bit                   MC5OUT              __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 MC5OUT_bit          _BIT_ACCESS(CMOUT,4)
// CMOUT<MC6OUT>
extern volatile __bit                   MC6OUT              __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 MC6OUT_bit          _BIT_ACCESS(CMOUT,5)
// CLCDATA<MCLC1OUT>
extern volatile __bit                   MCLC1OUT            __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MCLC1OUT_bit        _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MCLC2OUT>
extern volatile __bit                   MCLC2OUT            __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MCLC2OUT_bit        _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MCLC3OUT>
extern volatile __bit                   MCLC3OUT            __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MCLC3OUT_bit        _BIT_ACCESS(CLCDATA,2)
// MD1CON0<MD1BIT>
extern volatile __bit                   MD1BIT              __at(0x18A8);	// @ (0x315 * 8 + 0)
#define                                 MD1BIT_bit          _BIT_ACCESS(MD1CON0,0)
// MD1CARH<MD1CH0>
extern volatile __bit                   MD1CH0              __at(0x18C8);	// @ (0x319 * 8 + 0)
#define                                 MD1CH0_bit          _BIT_ACCESS(MD1CARH,0)
// MD1CARH<MD1CH1>
extern volatile __bit                   MD1CH1              __at(0x18C9);	// @ (0x319 * 8 + 1)
#define                                 MD1CH1_bit          _BIT_ACCESS(MD1CARH,1)
// MD1CARH<MD1CH2>
extern volatile __bit                   MD1CH2              __at(0x18CA);	// @ (0x319 * 8 + 2)
#define                                 MD1CH2_bit          _BIT_ACCESS(MD1CARH,2)
// MD1CARH<MD1CH3>
extern volatile __bit                   MD1CH3              __at(0x18CB);	// @ (0x319 * 8 + 3)
#define                                 MD1CH3_bit          _BIT_ACCESS(MD1CARH,3)
// MD1CARH<MD1CH4>
extern volatile __bit                   MD1CH4              __at(0x18CC);	// @ (0x319 * 8 + 4)
#define                                 MD1CH4_bit          _BIT_ACCESS(MD1CARH,4)
// MD1CON1<MD1CHPOL>
extern volatile __bit                   MD1CHPOL            __at(0x18B5);	// @ (0x316 * 8 + 5)
#define                                 MD1CHPOL_bit        _BIT_ACCESS(MD1CON1,5)
// MD1CON1<MD1CHSYNC>
extern volatile __bit                   MD1CHSYNC           __at(0x18B4);	// @ (0x316 * 8 + 4)
#define                                 MD1CHSYNC_bit       _BIT_ACCESS(MD1CON1,4)
// MD1CARL<MD1CL0>
extern volatile __bit                   MD1CL0              __at(0x18C0);	// @ (0x318 * 8 + 0)
#define                                 MD1CL0_bit          _BIT_ACCESS(MD1CARL,0)
// MD1CARL<MD1CL1>
extern volatile __bit                   MD1CL1              __at(0x18C1);	// @ (0x318 * 8 + 1)
#define                                 MD1CL1_bit          _BIT_ACCESS(MD1CARL,1)
// MD1CARL<MD1CL2>
extern volatile __bit                   MD1CL2              __at(0x18C2);	// @ (0x318 * 8 + 2)
#define                                 MD1CL2_bit          _BIT_ACCESS(MD1CARL,2)
// MD1CARL<MD1CL3>
extern volatile __bit                   MD1CL3              __at(0x18C3);	// @ (0x318 * 8 + 3)
#define                                 MD1CL3_bit          _BIT_ACCESS(MD1CARL,3)
// MD1CARL<MD1CL4>
extern volatile __bit                   MD1CL4              __at(0x18C4);	// @ (0x318 * 8 + 4)
#define                                 MD1CL4_bit          _BIT_ACCESS(MD1CARL,4)
// MD1CON1<MD1CLPOL>
extern volatile __bit                   MD1CLPOL            __at(0x18B1);	// @ (0x316 * 8 + 1)
#define                                 MD1CLPOL_bit        _BIT_ACCESS(MD1CON1,1)
// MD1CON1<MD1CLSYNC>
extern volatile __bit                   MD1CLSYNC           __at(0x18B0);	// @ (0x316 * 8 + 0)
#define                                 MD1CLSYNC_bit       _BIT_ACCESS(MD1CON1,0)
// MD1CON0<MD1EN>
extern volatile __bit                   MD1EN               __at(0x18AF);	// @ (0x315 * 8 + 7)
#define                                 MD1EN_bit           _BIT_ACCESS(MD1CON0,7)
// MD1SRC<MD1MS0>
extern volatile __bit                   MD1MS0              __at(0x18B8);	// @ (0x317 * 8 + 0)
#define                                 MD1MS0_bit          _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MD1MS1>
extern volatile __bit                   MD1MS1              __at(0x18B9);	// @ (0x317 * 8 + 1)
#define                                 MD1MS1_bit          _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MD1MS2>
extern volatile __bit                   MD1MS2              __at(0x18BA);	// @ (0x317 * 8 + 2)
#define                                 MD1MS2_bit          _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MD1MS3>
extern volatile __bit                   MD1MS3              __at(0x18BB);	// @ (0x317 * 8 + 3)
#define                                 MD1MS3_bit          _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MD1MS4>
extern volatile __bit                   MD1MS4              __at(0x18BC);	// @ (0x317 * 8 + 4)
#define                                 MD1MS4_bit          _BIT_ACCESS(MD1SRC,4)
// MD1CON0<MD1OPOL>
extern volatile __bit                   MD1OPOL             __at(0x18AC);	// @ (0x315 * 8 + 4)
#define                                 MD1OPOL_bit         _BIT_ACCESS(MD1CON0,4)
// MD1CON0<MD1OUT>
extern volatile __bit                   MD1OUT              __at(0x18AD);	// @ (0x315 * 8 + 5)
#define                                 MD1OUT_bit          _BIT_ACCESS(MD1CON0,5)
// MD2CON0<MD2BIT>
extern volatile __bit                   MD2BIT              __at(0x18D8);	// @ (0x31B * 8 + 0)
#define                                 MD2BIT_bit          _BIT_ACCESS(MD2CON0,0)
// MD2CARH<MD2CH0>
extern volatile __bit                   MD2CH0              __at(0x18F8);	// @ (0x31F * 8 + 0)
#define                                 MD2CH0_bit          _BIT_ACCESS(MD2CARH,0)
// MD2CARH<MD2CH1>
extern volatile __bit                   MD2CH1              __at(0x18F9);	// @ (0x31F * 8 + 1)
#define                                 MD2CH1_bit          _BIT_ACCESS(MD2CARH,1)
// MD2CARH<MD2CH2>
extern volatile __bit                   MD2CH2              __at(0x18FA);	// @ (0x31F * 8 + 2)
#define                                 MD2CH2_bit          _BIT_ACCESS(MD2CARH,2)
// MD2CARH<MD2CH3>
extern volatile __bit                   MD2CH3              __at(0x18FB);	// @ (0x31F * 8 + 3)
#define                                 MD2CH3_bit          _BIT_ACCESS(MD2CARH,3)
// MD2CARH<MD2CH4>
extern volatile __bit                   MD2CH4              __at(0x18FC);	// @ (0x31F * 8 + 4)
#define                                 MD2CH4_bit          _BIT_ACCESS(MD2CARH,4)
// MD2CON1<MD2CHPOL>
extern volatile __bit                   MD2CHPOL            __at(0x18E5);	// @ (0x31C * 8 + 5)
#define                                 MD2CHPOL_bit        _BIT_ACCESS(MD2CON1,5)
// MD2CON1<MD2CHSYNC>
extern volatile __bit                   MD2CHSYNC           __at(0x18E4);	// @ (0x31C * 8 + 4)
#define                                 MD2CHSYNC_bit       _BIT_ACCESS(MD2CON1,4)
// MD2CARL<MD2CL0>
extern volatile __bit                   MD2CL0              __at(0x18F0);	// @ (0x31E * 8 + 0)
#define                                 MD2CL0_bit          _BIT_ACCESS(MD2CARL,0)
// MD2CARL<MD2CL1>
extern volatile __bit                   MD2CL1              __at(0x18F1);	// @ (0x31E * 8 + 1)
#define                                 MD2CL1_bit          _BIT_ACCESS(MD2CARL,1)
// MD2CARL<MD2CL2>
extern volatile __bit                   MD2CL2              __at(0x18F2);	// @ (0x31E * 8 + 2)
#define                                 MD2CL2_bit          _BIT_ACCESS(MD2CARL,2)
// MD2CARL<MD2CL3>
extern volatile __bit                   MD2CL3              __at(0x18F3);	// @ (0x31E * 8 + 3)
#define                                 MD2CL3_bit          _BIT_ACCESS(MD2CARL,3)
// MD2CARL<MD2CL4>
extern volatile __bit                   MD2CL4              __at(0x18F4);	// @ (0x31E * 8 + 4)
#define                                 MD2CL4_bit          _BIT_ACCESS(MD2CARL,4)
// MD2CON1<MD2CLPOL>
extern volatile __bit                   MD2CLPOL            __at(0x18E1);	// @ (0x31C * 8 + 1)
#define                                 MD2CLPOL_bit        _BIT_ACCESS(MD2CON1,1)
// MD2CON1<MD2CLSYNC>
extern volatile __bit                   MD2CLSYNC           __at(0x18E0);	// @ (0x31C * 8 + 0)
#define                                 MD2CLSYNC_bit       _BIT_ACCESS(MD2CON1,0)
// MD2CON0<MD2EN>
extern volatile __bit                   MD2EN               __at(0x18DF);	// @ (0x31B * 8 + 7)
#define                                 MD2EN_bit           _BIT_ACCESS(MD2CON0,7)
// MD2SRC<MD2MS0>
extern volatile __bit                   MD2MS0              __at(0x18E8);	// @ (0x31D * 8 + 0)
#define                                 MD2MS0_bit          _BIT_ACCESS(MD2SRC,0)
// MD2SRC<MD2MS1>
extern volatile __bit                   MD2MS1              __at(0x18E9);	// @ (0x31D * 8 + 1)
#define                                 MD2MS1_bit          _BIT_ACCESS(MD2SRC,1)
// MD2SRC<MD2MS2>
extern volatile __bit                   MD2MS2              __at(0x18EA);	// @ (0x31D * 8 + 2)
#define                                 MD2MS2_bit          _BIT_ACCESS(MD2SRC,2)
// MD2SRC<MD2MS3>
extern volatile __bit                   MD2MS3              __at(0x18EB);	// @ (0x31D * 8 + 3)
#define                                 MD2MS3_bit          _BIT_ACCESS(MD2SRC,3)
// MD2SRC<MD2MS4>
extern volatile __bit                   MD2MS4              __at(0x18EC);	// @ (0x31D * 8 + 4)
#define                                 MD2MS4_bit          _BIT_ACCESS(MD2SRC,4)
// MD2CON0<MD2OPOL>
extern volatile __bit                   MD2OPOL             __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 MD2OPOL_bit         _BIT_ACCESS(MD2CON0,4)
// MD2CON0<MD2OUT>
extern volatile __bit                   MD2OUT              __at(0x18DD);	// @ (0x31B * 8 + 5)
#define                                 MD2OUT_bit          _BIT_ACCESS(MD2CON0,5)
// MD3CON0<MD3BIT>
extern volatile __bit                   MD3BIT              __at(0x10D8);	// @ (0x21B * 8 + 0)
#define                                 MD3BIT_bit          _BIT_ACCESS(MD3CON0,0)
// MD3CARH<MD3CH0>
extern volatile __bit                   MD3CH0              __at(0x10F8);	// @ (0x21F * 8 + 0)
#define                                 MD3CH0_bit          _BIT_ACCESS(MD3CARH,0)
// MD3CARH<MD3CH1>
extern volatile __bit                   MD3CH1              __at(0x10F9);	// @ (0x21F * 8 + 1)
#define                                 MD3CH1_bit          _BIT_ACCESS(MD3CARH,1)
// MD3CARH<MD3CH2>
extern volatile __bit                   MD3CH2              __at(0x10FA);	// @ (0x21F * 8 + 2)
#define                                 MD3CH2_bit          _BIT_ACCESS(MD3CARH,2)
// MD3CARH<MD3CH3>
extern volatile __bit                   MD3CH3              __at(0x10FB);	// @ (0x21F * 8 + 3)
#define                                 MD3CH3_bit          _BIT_ACCESS(MD3CARH,3)
// MD3CARH<MD3CH4>
extern volatile __bit                   MD3CH4              __at(0x10FC);	// @ (0x21F * 8 + 4)
#define                                 MD3CH4_bit          _BIT_ACCESS(MD3CARH,4)
// MD3CON1<MD3CHPOL>
extern volatile __bit                   MD3CHPOL            __at(0x10E5);	// @ (0x21C * 8 + 5)
#define                                 MD3CHPOL_bit        _BIT_ACCESS(MD3CON1,5)
// MD3CON1<MD3CHSYNC>
extern volatile __bit                   MD3CHSYNC           __at(0x10E4);	// @ (0x21C * 8 + 4)
#define                                 MD3CHSYNC_bit       _BIT_ACCESS(MD3CON1,4)
// MD3CARL<MD3CL0>
extern volatile __bit                   MD3CL0              __at(0x10F0);	// @ (0x21E * 8 + 0)
#define                                 MD3CL0_bit          _BIT_ACCESS(MD3CARL,0)
// MD3CARL<MD3CL1>
extern volatile __bit                   MD3CL1              __at(0x10F1);	// @ (0x21E * 8 + 1)
#define                                 MD3CL1_bit          _BIT_ACCESS(MD3CARL,1)
// MD3CARL<MD3CL2>
extern volatile __bit                   MD3CL2              __at(0x10F2);	// @ (0x21E * 8 + 2)
#define                                 MD3CL2_bit          _BIT_ACCESS(MD3CARL,2)
// MD3CARL<MD3CL3>
extern volatile __bit                   MD3CL3              __at(0x10F3);	// @ (0x21E * 8 + 3)
#define                                 MD3CL3_bit          _BIT_ACCESS(MD3CARL,3)
// MD3CARL<MD3CL4>
extern volatile __bit                   MD3CL4              __at(0x10F4);	// @ (0x21E * 8 + 4)
#define                                 MD3CL4_bit          _BIT_ACCESS(MD3CARL,4)
// MD3CON1<MD3CLPOL>
extern volatile __bit                   MD3CLPOL            __at(0x10E1);	// @ (0x21C * 8 + 1)
#define                                 MD3CLPOL_bit        _BIT_ACCESS(MD3CON1,1)
// MD3CON1<MD3CLSYNC>
extern volatile __bit                   MD3CLSYNC           __at(0x10E0);	// @ (0x21C * 8 + 0)
#define                                 MD3CLSYNC_bit       _BIT_ACCESS(MD3CON1,0)
// MD3CON0<MD3EN>
extern volatile __bit                   MD3EN               __at(0x10DF);	// @ (0x21B * 8 + 7)
#define                                 MD3EN_bit           _BIT_ACCESS(MD3CON0,7)
// MD3SRC<MD3MS0>
extern volatile __bit                   MD3MS0              __at(0x10E8);	// @ (0x21D * 8 + 0)
#define                                 MD3MS0_bit          _BIT_ACCESS(MD3SRC,0)
// MD3SRC<MD3MS1>
extern volatile __bit                   MD3MS1              __at(0x10E9);	// @ (0x21D * 8 + 1)
#define                                 MD3MS1_bit          _BIT_ACCESS(MD3SRC,1)
// MD3SRC<MD3MS2>
extern volatile __bit                   MD3MS2              __at(0x10EA);	// @ (0x21D * 8 + 2)
#define                                 MD3MS2_bit          _BIT_ACCESS(MD3SRC,2)
// MD3SRC<MD3MS3>
extern volatile __bit                   MD3MS3              __at(0x10EB);	// @ (0x21D * 8 + 3)
#define                                 MD3MS3_bit          _BIT_ACCESS(MD3SRC,3)
// MD3SRC<MD3MS4>
extern volatile __bit                   MD3MS4              __at(0x10EC);	// @ (0x21D * 8 + 4)
#define                                 MD3MS4_bit          _BIT_ACCESS(MD3SRC,4)
// MD3CON0<MD3OPOL>
extern volatile __bit                   MD3OPOL             __at(0x10DC);	// @ (0x21B * 8 + 4)
#define                                 MD3OPOL_bit         _BIT_ACCESS(MD3CON0,4)
// MD3CON0<MD3OUT>
extern volatile __bit                   MD3OUT              __at(0x10DD);	// @ (0x21B * 8 + 5)
#define                                 MD3OUT_bit          _BIT_ACCESS(MD3CON0,5)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PWMEN<MPWM11EN>
extern volatile __bit                   MPWM11EN            __at(0x6C72);	// @ (0xD8E * 8 + 2)
#define                                 MPWM11EN_bit        _BIT_ACCESS(PWMEN,2)
// PWMLD<MPWM11LD>
extern volatile __bit                   MPWM11LD            __at(0x6C7A);	// @ (0xD8F * 8 + 2)
#define                                 MPWM11LD_bit        _BIT_ACCESS(PWMLD,2)
// PWMOUT<MPWM11OUT>
extern volatile __bit                   MPWM11OUT           __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 MPWM11OUT_bit       _BIT_ACCESS(PWMOUT,2)
// PWMEN<MPWM5EN>
